[
    {
        "source":{
            "id":null,
            "name":"Psychology Today"
        },
        "topics": "Self Love",
        "author":"Sarah Merritt Ryan",
        "title":"Self-Love After Psychosis",
        "description":"A Personal Perspective: I thought my life was over after multiple psychotic breaks, but it wasn't. Here's how cultivating self-love directed me into my future.",
        "url":"https://www.psychologytoday.com/intl/blog/healing-mind/202311/self-love-after-psychosis",
        "image":"https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_91_1_1528x800/public/teaser_image/blog_entry/2023-11/pexels-hassan-ouajbir-1535288.jpg?itok=Qcnxswwy",
        "date":"2023-11-27",
        "content":"It is easy to be unduly hard on yourself for having psychosis. Choosing to love yourself anyway may not be easy, but it can serve as a road map out of darkness and into a bright future. \r\nI was so incredibly hard on myself after each time I was hospitalized for psychosis. I woke up every morning feeling defeated and like my life was over, or should be. I had no assurance, no confirmation, that my life as I knew it would ever return and move forward. I just had to force myself to put one foot in front of the other, believing that one day it was possible for my pain to be over and that I could recover.\r\nIt would have been so much easier if I had been able to see the future and know that my life would turn around and that my dreams would still come true. It would have been so encouraging to know that two years after my last psychotic break, I would secure a full-time job and a year later would land a career position. It would have been all the motivation in the world to already know that in five years I would marry the wonderful man I love in the presence of family members and friends who stuck by me. It would have been pure joy to know that in seven years I would give birth and become a mother. In those early months and years, though, all I could see in front of me were disability papers, medication, and a diagnosis, not to mention debilitating emotional pain and cognitive damage.\r\n<span class=\"strong\">One Step at a Time</span>\r\nI had felt like the mountain before me was too formidable to climb, but I am so thankful I did not give up. My favorite quote by Dr. Martin Luther King is, “Faith is taking the first step even when you can’t see the whole staircase.” I had to trust that I was moving forward in the right direction without having everything already figured out or being able to look ahead. To take those first steps, I had to love myself and feel loved to believe that I was still alive for a reason and that I matter. I had to love myself enough to want good things to happen in my life. I had to love myself to take the next step visible to me and have hope for the future.\r\n<span class=\"strong\">Self-Love Translates Into Many Things</span>\r\nLoving yourself translates into many other important things: The initiative to first seek treatment and then the persistence to stick with it. The tenacity to find the answers you are looking for and find the right doctor. The infinite patience you must have while your brain heals, and the wisdom to let the medicine do its work. The ability to realize that your illness is a medical condition, not a character flaw. The grace to know that you can still enjoy life even if you are not completely healed yet, and the faith that one day you could be completely yourself again. The confidence to accept you may need to take medication for life. The boldness to make the best decisions for you, no matter what anyone else thinks about mental illness. The recognition, acceptance, and appreciation of others loving you and cheering you on, because feeling loved and supported also helps with the motivation and courage to recover.\r\n<span class=\"strong\">It Still Is Not Easy</span>\r\nYou can still have love for yourself, even if you have competing feelings like shame, anger, and sadness. Even though it has been eleven years since my last psychotic break, I still blame and shame myself a little sometimes for having had psychosis, as part of a mental health diagnosis so stigmatized by society. I struggle sometimes with being kind and forgiving to myself, even though I know I did nothing wrong by having mental illness. In other words, none of this is easy. Coming to terms with how I feel about what I went through is still an ongoing battle for me, but I’m winning because love always seems to win in the end. I have found this to be true in my story, and I think love can win in your life too.\r\nI had thought that the worst thing in the world was to lose your mind, but it isn’t. The condition of your heart matters more. The ability to choose love is the one thing that can never be taken away from you."
    },
    {
        "source":{
            "id":null,
            "name":"Hyperallergic"
        },
        "topics": "Self Love",
        "author":"Samantha Anne Carrillo",
        "title":"Carmen Selam’s Debut Comic Is Self-Love Medicine",
        "description":"In the limited-edition risograph comic Rezbians, Selam shares a solution for the scarcity of queer Indigenous representation in pop culture.",
        "url":"http://hyperallergic.com/859274/carmen-selam-debut-comic-rezbians-is-self-love-medicine/",
        "image":"https://hyperallergic-newspack.s3.amazonaws.com/uploads/2023/11/rezbians6.png",
        "date":"2023-11-30",
        "content":"ALBUQUERQUE In the limited-edition risograph comic Rezbians, Carmen Selam (Yakama, Comanche) shares a solution for the scarcity of queer Indigenous representation in pop culture, of which the artist was keenly aware growing up on the Yakama Indian Reservation in Washington State.\r\nPrinted during Selam’s recent artist residency at Albuquerque community risograph studio Risolana, Rezbians incorporates various visual styles and illustrative and printing techniques to create its interior world, all with just two ink colors. (An exhibition accompanying the book launch continues at Fourteenfifteen Gallery through December 1.) Printed entirely in black and a light mauve-pink — the color she chose to add to Risolana’s permanent ink selection — on cream-colored paper, the comic transcends the visual monotony that such a design restriction could portend.\r\nAccording to Selam, the two-color format was a self-issued design challenge. “Light mauve felt really nostalgic and like something I wanted to use with different textures and things. So, throughout Rezbians, I utilized light mauve with my halftones. Then, I flood a whole page with light mauve — the way it mixes with black creates this really beautiful almost optical illusion of purple,” the artist said in conversation with Hyperallergic, adding that the color “would have a strong presence mixed with the choice of the paper, which I wanted to translate into this old-school comic feel.”\r\n<img class=\"image2\" src=\"https://i0.wp.com/hyperallergic-newspack.s3.amazonaws.com/uploads/2023/11/rezbians5.png?resize=1116%2C1536&quality=100&ssl=1\"></img>\r\nThe chapters within Rezbians are bookended by Selam’s tributes to subsistence and pleasure via advertisements for the fictitious Fry Bread Stand, Rez Cat Chow, and Kúpi, an Ichishkíin word for coffee. Her reworking of extant advertisement styles was informed by the role that commodity foods have played on the reservation in caring for both oneself and one’s elders.\r\nCultural values were also fleshed out by main character Eli’s love interest, Olivia, who visits the reservation to care for her grandmother. “Taking care of your elders was something I wanted to represent in Rezbians — that ritual of making coffee in the morning, making sure they have their cup, and then going to replenish the stock of what’s on the rez. It’s a whole venture. Going to the stores is something you plan for and spend all day doing,” Selam explained.\r\nSelam was also intentional about avoiding common damaging or oversimplified clichés often applied to LGBTQ+ experiences and lifestyles. “It was really important to me to avoid tropes of queer people dying or a love triangle or coming out, or [the idea that] ‘you have to leave the rez to be successful.’ I really wanted to avoid those narratives and leave it very open, like there’s power in finding yourself and being with yourself.”\r\nWhile Eli and Olivia’s romantic relationship does end, the overarching narrative in Rezbians is one of self-love. The closing panel finds Eli reckoning with the importance of loving themself — “I am my own love medicine” —  a superpower that is amplified by community and cultural connections that ground this beautifully illustrated tale."
    },
    {
        "source":{
            "id":null,
            "name":"ComingSoon.net"
        },
        "topics": "Self Love",
        "author":"Oviya Priyadharshini",
        "title":"Modern Love Mumbai Streaming: Watch & Stream Online via Amazon Prime Video",
        "description":"Modern Love Mumbai is an Indian Hindi-language romantic slice of life anthology that explores six distinct yet universal stories of human connection and love in its various manifestations, including romantic, platonic, parental, sexual, family, marriage, and …",
        "url":"https://www.comingsoon.net/guides/news/1419601-modern-love-mumbai-streaming-watch-stream-online-via-amazon-prime-video",
        "image":"https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/Untitled-design-28-3.jpg?resize=1200,630",
        "date":"2023-11-29",
        "content":"Modern Love Mumbai is an Indian Hindi-language romantic slice of life anthology that explores six distinct yet universal stories of human connection and love in its various manifestations, including romantic, platonic, parental, sexual, family, marriage, and self-love, in six different episodes.\r\nThe series, adapted for film from the New York Times’s crowd-favorite column of the same name, continues the formula of its predecessors, with each episode lasting roughly 35-45 minutes. Six directors, six stories, and six perspectives all merge into one in the final episode.\r\nThe main cast includes:\r\n<ul><li>Fatima Sana Shaikh as Lalzari “Lali”</li><li>Bhupendra Jadawat as Lutfi</li><li>Wamiqa Gabbi as Megha</li><li>Tannishtha Chatterjee as Rayman</li><li>Dilip Prabhavalkar as Nazrul</li><li>Girija Oak as Kirti</li><li>Shovon Jaman as Driver</li><li>Pratik Gandhi as Manzar “Manzu” Ali</li><li>Ranveer Brar as Rajveer</li><li>Tanuja as Baai</li><li>Kashmira Irani as Rehana and</li><li>Rushad Rana as Zohaib among others.</li></ul>\r\n<span class=\"strong\">Watch Modern Love Mumbai streaming via Amazon Prime Video</span>\r\nModern Love Mumbai is available to watch on Amazon Prime Video. Moreover, a subscription to the streamer allows you to access several movies and TV shows, including originals like The Summer I Turned Pretty, The Wheel of Time, and A Million Miles Away.\r\nYou can watch via Amazon Prime Video by following these steps:\r\n<ol><li>Go to Amazon Prime Video</li><li>Select ‘Sign in’ and ‘Create your Amazon account’</li><li>Sign up for a Prime Video membership</li></ol>\r\nAmazon Prime is the online retailer’s paid service that provides fast shipping and exclusive sales on products, so the membership that includes both this service and Prime Video is the company’s most popular offering. However, you can also opt to subscribe to Prime Video separately.\r\nModern Love Mumbai synopsis is as follows:\r\n<i>“Exploring 6 unique yet universal stories of human connection and love in its varied forms - romantic, platonic, parental, sexual, familial, marital, self love.”</i>\r\n<i>NOTE: The streaming services listed above are subject to change. The information provided was correct at the time of writing.</i>"
    },
    {
        "source":{
            "id":null,
            "name":"mindbodygreen.com"
        },
        "topics": "Self Love",
        "author":"Tanya Carroll Richardson",
        "title":"6 Simple Steps To Invite More Love & Joy This Holiday Season",
        "description":"(And avoid burning out.)",
        "url":"https://www.mindbodygreen.com/articles/ritual-to-receive",
        "image":"https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_2000,h_1200,g_auto,fl_lossy,f_jpg/org/0p4ucbqvukhnsbj5v.jpg",
        "date":"2023-11-21",
        "content":"How open are you to receiving? In other words, being the one who is accepting a gift instead of the one giving, or sometimes surrendering and letting things happen for you instead of always being proactive and making things happen?\r\nBeing assertive and proactive are healthy, practical, and necessary ways to move through the world. However, balancing this energy with its opposite—receiving and allowing—promotes greater well-being and easier manifestation.\r\nIf receiving feels uncomfortable or vulnerable for you, that's very normal. Many people experienced childhood wounds or very challenging seasons from their pasts that can make expecting help or good things now feel unsafe or unrealistic.\r\nYou might be a natural caretaker or even an earth angel and just love to give. Yet at times, you could go into burnout because you're giving all the time and not receiving enough from yourself and others to balance all that giving.\r\nWhatever your relationship to receiving, try this receiving ritual to connect with more grace and support:\r\n<span class=\"strong\">1. Set your intention</span>\r\nSet the intention that you'd like to rest and receive more, instead of giving and doing as much, for the next week or seven days. You can set this intention silently in a prayer or meditation or by writing it down in your journal.\r\nFor now, keep this sacred intention secret—just a little experiment between you and the universe. Let your energy soften, becoming open, gentle, and curious about how the week will unfold!\r\n<span class=\"strong\">2. Continue business as usual</span>\r\nFor the next seven days, go about your life normally. Take care of your regular responsibilities and help others in ways that are appropriate and healthy. But also take a more surrendered, relaxed attitude toward issues in your life.\r\nIf you've been pushing to get a promotion or the green light on a creative project, or pushing your partner or roommate to tackle a to-do list, take a week off that agenda or adopt a more peaceful and less pushy attitude. Have more healthy detachment around your goals in general.\r\n<span class=\"strong\">3. Pour into yourself</span>\r\nReceive more from yourself by leaning into your self-care and self-love practice. Speak lovingly and encouragingly to yourself in your own mind, take time out to rest, and engage in your favorite activities.\r\nPractice saying no with love to others when the request doesn't honor you or will be too draining. If self-love is something you struggle with or want to work with more mindfully, try my annual calendar, A Year of Self-Love, which has a healing self-love message and action step for every day of the year.\r\n<span class=\"strong\">4. Watch for others to give to you in unexpected ways</span>\r\nYour favorite barista might treat you to a coffee, your child might offer to fold the laundry for you, or your boss might invite you to knock off work an hour early. You may receive in very big ways this week, but this isn't about winning the lottery or getting a call from Oprah—or getting exactly the outcome you desire.\r\nAs you align your energy more to receive and allow, the small gifts that can come to you quickly and easily will. And those small presents can have a big positive impact on your mood and your day.\r\n<span class=\"strong\">5. Reflect on what you've received</span>\r\nAt the end of each day, look back at anything you received—from a smile or kind word offered by a neighbor or co-worker to material resources like a surprise financial windfall to helpful signs and synchronicities from the universe.\r\nTake a moment to let yourself really register these gifts in your system, feeling more supported and grateful as a result. By attuning your energy to receiving, you might notice more often when someone or something is giving toward you as well as receive some unexpected blessings.\r\nAs the week ends, remind yourself that this intention to receive is an attitude or neural pathway you can work with and develop anytime.\r\n<span class=\"strong\">6. Mindfully give to others</span>\r\nHave days and weeks when you mindfully give more to others too and are more proactive about pushing your own agenda forward.\r\nThis could look like a week when you're feeling motivated and inspired or rested and recharged, so you make a point of giving a co-worker a compliment or giving a child in your life a supportive listening ear. You might decide to finally tackle that home project or plan how you'll ask for a raise before your next review.\r\n<span class=\"strong\">The takeaway</span>\r\nMaking one week a mindful time to receive can be a regular healing practice when you're recovering from burnout, feeling extra challenged, craving more support and comfort, or wanting to approach goals in a new way. Every day is a dance of giving and receiving, and both are very nourishing for the spirit!"
    },
    {
        "source":{
            "id":null,
            "name":"Pitchfork"
        },
        "topics": "Self Love",
        "author":"Vrinda Jagota",
        "title":"Priya Ragu: Santhosam",
        "description":"Read Vrinda Jagota’s review of the album.",
        "url":"https://pitchfork.com/reviews/albums/priya-ragu-santhosam/",
        "image":"https://media.pitchfork.com/photos/65660a08345b31342ca5cddf/16:9/w_1280,c_limit/Priya%20Ragu-%20Santhosam.jpeg",
        "date":"2023-11-29",
        "content":"Like so many in the South Asian diaspora, 37-year-old Tamil Swiss singer and rapper Priya Ragu is hungry for art that speaks to the complexity of our experiences. She has said that there’s no single theme to her new album, Santhosam, which touches on topics as varied as combating familial pressure, craving a vacation, and contesting police brutality. But throughout her career, her work has centered around her desire to express her perspective as the child of Sri Lankan refugees and to reach other South Asian listeners in the process. She called her debut mixtape damnshestamil. She wears saris with T-shirts in performances, sings in her mother tongue, and dedicates a song on the new album to her grandmother (a common gesture among South Asian diasporic artists). In her music, she pulls equally from R&B, rap, and Tamil folk, creating a blend she calls “Ragu-wavy.”\r\n“Ragu-wavy” pairs the boisterous production of Santigold and fellow Tamil diasporic artist M.I.A. with the adroit vocal stylings of Snoh Aalegra or Sade. Ragu is also a student of the Tamil music she grew up hearing at home: She specifically draws from kuthu, a fast-paced, drum-forward type of folk music found in Kollywood (Tamil-language cinema) films and sampled by M.I.A. The bombastic arrangements of tracks like “Escape” and “Adalam Va!” convey the self-determined optimism suggested by the title Santhosam (Happiness), whether Ragu is singing about a burgeoning relationship or urging us to hold onto our faith. She sounds confident and dexterous when she raps in Tamil, as in the chorus of audacious self-love anthem “Power,” where she hopscotches defiantly over cascading violin and synth.\r\nAlbum closer “Mani Osai,” which Ragu wrote with her father and brother, makes her mastery of South Asian musical traditions especially clear. Gentle tabla and humming synth establish a slow-moving ambient river while violin swells, golden bansuri notes, and layered vocals that sound right out of an A. R. Rahman composition flutter like confetti. Ragu sings patiently and warmly in Tamil, delivering her most affecting vocal performance on the record.\r\nAs she builds her vision for South Asian diasporic pop, Ragu looks to an earlier generation of Black American artists for inspiration. She cites Lauryn Hill, Stevie Wonder, and Brandy as influences and draws on elements of R&B and rap. The most political track on the album, “Black Goose,” was written amid the 2020 Black Lives Matter movement to honor George Floyd’s life. There’s a long history of Asian musicians allying themselves in solidarity with Black artists; Ragu specifically identifies a connection between the Black Lives Matter movement and her family’s history surviving the genocide of Tamils in Sri Lanka. But by invoking anti-Black oppression in the first person—“Officer don’t shoot, I got so much shit to do,” she sings in the chorus—she winds up conflating racialized experiences in a way that feels vague and appropriative rather than supportive.\r\n<img class=\"image2\" src=\"https://media.pitchfork.com/photos/65660a08345b31342ca5cddf/1:1/w_320,c_limit/Priya%20Ragu-%20Santhosam.jpeg\"></img>\r\nAt times Ragu’s songwriting can feel like a missed opportunity to know her better. The Afrobeats-inflected “Hit the Bucket” is a laundry list of flexes interwoven with a directive to dance. Quotables like “Melanin dream with a hella mean sheen” and “Don diva fold my hands like Shiva” edge close to a “representation matters” genre of feel-good art that celebrates the signifiers of identity without exploring what it is they signify. On “Vacation,” Ragu dreams of slowing down, healing, and turning off her phone, generic sentiments that could hang beside a “Live Laugh Love” plaque.\r\nThe best South Asian diasporic art is a balm for an enduring sense of placelessness. It is rooted in a deep familiarity with disparate cultures and artistic traditions yet requires a willingness to innovate something new. Ragu offers her most memorable portrait of this experience on “School Me Like That,” where she contrasts the expectations of her family and workplace with the urgency of her own dreams. (The song follows a message in Tamil from her grandmother asking her to get married.) “How can I stay awake for somebody else dream when/I got so much life in me that I should be living?” she asks. Music and message coalesce in words that capture both where she comes from and where she wants to go. Santhosam could use more songs with this level of intentionality—songs that reach beyond proclamations of self-love or dancefloor hedonism to meet the richness and complexity of Ragu’s sound and aesthetic."
    },
    {
        "source":{
            "id":null,
            "name":"Betterhumans.pub"
        },
        "topics": "Self Love",
        "author":"Suzanne Berger",
        "title":"How I Embarked on My Voyage of Self-Discovery",
        "description":"If so, keep reading. This article explores discovering your true self, embracing self-love, and boldly stepping into the world with confidence. When I’ve interacted with others in most spaces, “Who…",
        "url":"https://betterhumans.pub/how-i-embarked-on-my-voyage-of-self-discovery-5d4ef0e78975",
        "image":"https://miro.medium.com/v2/da:true/resize:fit:1200/0*4uqihoqh6d5a8pVk",
        "date":"2023-11-26",
        "content":"Are you an empathetic person struggling to understand your true identity?\r\nIf so, keep reading. This article explores discovering your true self, embracing self-love, and boldly stepping into the world with confidence.\r\nWhen I’ve interacted with others in most spaces, “Who do they want me to be?” has often dominated my thoughts.\r\nI found myself using words and taking actions to see if they felt right, but more to see how they felt to others. If people I respected accepted them, then they must be right.\r\nOr even people I didn’t respect- it didn’t matter. I wanted validation. I felt like an alien from a distant universe, trying on behaviors to see what gave me the appearance of being human.\r\nThe thoughts would spin in circles- Maybe this? But no, that won’t work… or that? Yes! Wait, no… that might seem too strange.\r\nSociety, culture, family- these and other factors can have a tremendous impact on who we believe we are. The noise can even drown out the authentic voice inside our souls.\r\nWhile the noise can be deafening, you can overcome it with some intentional effort.\r\nThe fact is, you are a wonderful and unique person. Figuring out who you are and being able to share it with others is a gift beyond measure.\r\nSo, how did I find my true self? Here are a few lessons I picked up along the journey.\r\n<span class=\"strong\">Take Time for Quiet Creating</span>\r\nIt can be deafening trying to find yourself in crowds. It’s been so much easier to uncover the true me through activities like writing, drawing, and listening to my thoughts in action.\r\nI find that when I create, the real me comes out onto the paper or whatever medium I’m using.\r\nSomething about creating art in any form expands my mental horizons."
    },
    {
        "source":{
            "id":null,
            "name":"Hubspot.com"
        },
        "topics": "Self Love",
        "author":"Cyan Zhong",
        "title":"How to Earn Customer Love as Dating Apps Fall Behind",
        "description":"Online dating is a $9.6B market that lures in millions of singles worldwide. The US leads the pack: Three in 10 Americans have dabbled in dating apps, and 10% even found a serious partner there.",
        "url":"https://blog.hubspot.com/sales/dating-goes-old-school#article",
        "image":"https://blog.hubspot.com/hubfs/Copy%20of%20Featured%20Image%20Template%20Backgrounds%20%2814%29.jpg#keepProtocol",
        "date":"2023-12-05",
        "content":"Online dating is a $9.6B market that lures in millions of singles worldwide. The US leads the pack: Three in 10 Americans have dabbled in dating apps, and 10% even found a serious partner there.\r\nBut it’s not all roses:\r\n😥 ~80% of users say they have online dating burnout\r\n🚫 ~90% have felt the need to take a break from online dating\r\n👀 Dating apps are getting creepier with too much AI\r\nSubsequently, popular apps have been losing users.\r\nThis fatigue is ushering in a renaissance of ‘the good old days,’ when dating was less digital.\r\nSingles, especially Gen Zers, are preaching the good vibes of a pre-swipe world. Here are two ways business builders can serve them:\r\nHow Your Business Can Solve for Online Dating Woes\r\n<h3>1. Help your audience lean on a trusted network</h3>\r\nOne of the reasons for online dating burnout is the lack of trust (unsurprising, really). Finding a boo through more reliable channels, like friends, is making a comeback.\r\nTinder recently launched a friend matchmaking feature, responding to the fact that over 75% of singles discuss their dating life with friends every month.\r\nBut with Tinder’s user decline and overall perception, you could unbundle it and build a community-driven platform that focuses on friend-vetted dates. A few ways it could thrive:\r\n<ul><li><b>Keep it tight-knit:</b> Act as an independent middleman and screen candidates based on social media presence and even friend interviews, before allowing them to create profiles.</li><li><b>Learn from others’ mistakes:</b> Existing friend matchmaking options like Wingman have abysmal reviews. Find out what users hate about it and optimize that experience.</li><li><b>Intention matters:</b> Sometimes the lack of trust comes from lackluster effort on a date. So add on a resource hub with friend-approved dating spots and activities.</li></ul>\r\n<h3>2. Invest in self-love</h3>\r\nAt least one third of app users have experienced fatigue or burnout from today's dating landscape. Luckily, 80% of 18-25 year olds now see self care as the top priority when dating, and want their prospective partners to do the same.\r\nSo, why not focus your business or offerings on helping singles enhance self-love in their dating life? To do this, you could:\r\n📝 Create a dating detox app with quizzes to assess users’ self-love strengths and weaknesses. Then provide a curated list of resources to teach them self care, communication, and setting healthy boundaries.\r\n🤓 Help produce high-end date-me docs. These are long-form profiles that tech workers in the US are using to tell prospective dates about themselves, and they need help.\r\n❤️‍🩹 Niche down and offer self care counseling to divorcees. Divorce is still heavily stigmatized in many cultures, and these people need to build the self-love muscle before they get back into the cruel dating world.\r\nFinally, don’t snooze on those who are enjoying a break from dating altogether. Opportunities abound in the singles market, like consumer-goods-for-one, and financial planning apps (because it can get expensive).\r\nWant more content like this? Sign up for our weekly Trends email, filled with all sorts of data, deep dives, and trend insights for business builders, entrepreneurs and innovative professionals."
    },
    {
        "source":{
            "id":null,
            "name":"The Indian Express"
        },
        "topics": "Self Love",
        "author":"Lifestyle Desk",
        "title":"Why hugging is important for your mental and physical health",
        "description":"We explore why hugging is essential for our overall well-being and how it can enhance our lives in various ways.",
        "url":"https://indianexpress.com/article/lifestyle/feelings/hugging-important-mental-physical-health-9013161/",
        "image":"https://images.indianexpress.com/2023/11/hugging.jpg",
        "date":"2023-11-20",
        "content":"Hugs, those warm, comforting gestures of affection, have a profound impact on our well-being. Beyond their ability to convey love and connection, hugging is a powerful tool that can significantly benefit both mental and physical health.\r\nFrom reducing stress to promoting emotional connection and even enhancing physical health, hugging is an essential aspect of our lives.\r\nWe explore why hugging is important for our overall well-being and how it can enhance our lives in various ways.\r\n<h3>The science behind hugging</h3>\r\nMehezabin Dordi, clinical psychologist, Sir HN Reliance Foundation Hospital, explained that hugging triggers the release of oxytocin, often referred to as the “love hormone” or “bonding hormone.” “It plays a crucial role in social bonding, attachment, and emotional regulation. The increase in oxytocin levels promotes feelings of trust, empathy, and attachment to the person hugging us.”\r\nShe added that hugging can activate the brain’s reward centres, particularly the ventral striatum. “This is the area of the brain associated with pleasure and reward. It reinforces the positive experience of the hug and encourages individuals to seek out social interactions and physical closeness.”\r\nHere’s why hugging matters for your physical and mental health.\r\n<h3>Physical Health</h3>\r\n<b>i. Pain Relief:</b> Physical touch, like massage or even a simple hug, can stimulate the release of endorphins, which are natural painkillers. It can help reduce the perception of pain and alleviate discomfort.\r\n<b>ii. Stress Reduction:</b> Touch triggers the release of oxytocin, a hormone that can lower cortisol levels and reduce stress. Chronic stress is linked to various health issues, so reducing stress through touch can have long-term health benefits.\r\n<b>iii. Immune System Boost:</b> Research suggests that positive physical interactions, such as hugging, can strengthen the immune system. The reduction in stress and the release of oxytocin may play a role in improving immune function.\r\n<b>iv. Heart Health:</b> Physical touch, especially hugging, can lead to a decrease in blood pressure and heart rate. Over time, this can contribute to better cardiovascular health.\r\n<img class=\"image2\"src=\"https://images.indianexpress.com/2023/11/mood-swings.jpg?resize=1536,1536\"></img>\r\n<h3>Emotional Health</h3>\r\n<b>i. Mood Improvement:</b> Physical touch, including hugging, stimulates the release of endorphins, which can elevate mood and create feelings of happiness and well-being. It’s a natural mood enhancer.\r\n<b>ii. Anxiety and Depression Reduction:</b> Hugging and physical touch can provide comfort and emotional support. This can be particularly valuable in reducing symptoms of anxiety and depression, as it fosters a sense of connection and security.\r\n<b>iii. Emotional Connection:</b> Touch is a powerful means of non-verbal communication. It can convey emotions like love, empathy, and understanding, which are essential for building and maintaining relationships. Strong social connections are closely tied to emotional well-being.\r\n<b>iv. Stress Management:</b> Regular physical touch can act as a stress management tool. It helps regulate the body’s stress response, making it easier to cope with the challenges of daily life and reducing the long-term impact of chronic stress on emotional health.\r\nOther than hugging your friends and family, don’t forget the therapeutic power of cuddling with your furry friends. The love you share with your pets is equally meaningful.\r\nRemember that self-hugs count too. Embrace yourself with self-compassion and self-love. It can have a soothing effect, especially during moments of self-doubt or anxiety.\r\nSo, the next time you have the opportunity, share a warm embrace with someone you care about, and feel the profound impact it can have on your life."
    },
    {
        "source":{
            "id":null,
            "name":"Cosmopolitan.com"
        },
        "topics": "Self Love",
        "author":"Laura Lajiness Kaupke",
        "title":"Treat Yourself: 9 Must-Have Gifts at Every Price Point for the Holidays",
        "description":"Because who knows your taste better than you?",
        "url":"https://www.cosmopolitan.com/style-beauty/g45972989/treat-yourself-9-must-have-gifts-at-every-price-point-for-the-holidays/",
        "image":"https://hips.hearstapps.com/hmg-prod/images/cosmo-de-beers2-6566698228120.png?crop=1.00xw:0.752xh;0,0.0385xh&resize=1200:*",
        "date":"2023-11-30",
        "content":"While you're busy picking out perfect presents for everyone else, let's not forget the most important person on your list: you. After all, self-love is the best lovenot to mention you deserve it, duh.\r\nAnd the best part? We've got you covered for every budget. Under-$100 gifts? Of course. Luxury indulgences? Natch. Under-$50 finds no one would ever suspect were? They're kind of your specialty. If you're a style-savvy snuggler who lives for a fun print to curl up in, we've got a cute option. Or if you're feeling spendy and ready to splurge on a forever pair of earrings that just so happen to enhance your new party dress perfectly, consider them secured. Whatever your holiday craving, we've curated the perfect me-list that's sure to make your style-loving heart skip a beat.\r\nGet ready to indulge in a little self-love shopping spree. From cozy must-haves that'll make you want to snuggle up all winter to glam goodies sure to dazzle at any holiday party, we've got something for every style and every price point. Because let's face it, you've been good this year, and it's time to reward yourself with the things you really want. Let the holiday self-gifting begin!\r\nRaise your hand if you're all in on the Mary Jane train. You'll be hard-pressed to find a more spectacular option than this darling moire pair. And the rounded, squared toes? Ugh, we can't even—they're a dream.\r\nStripes are a dime a dozen in the pajama realm. Instead, make a bigger statement at the cozy family function in a checkerboard-print set. The silk is what self-appreciating luxury is all about—and even better, they're machine washable. Blessings.\r\nYou don't have to be a July baby to lust after these ruby-and-diamond drop earrings: timeless, festive, and totally worth the splurge. We've been thinking about combining them with a velvet dress and equally sparkly heels for a razzle-dazzle party look.\r\nWhat's more satisfying than a luxurious find for under $50? Nothing. So grab this quilted puffer quick—a cozy style you'll turn to for seasons to come. You'll wear it endlessly.\r\nRhinestones? Been there, done that. Go big-time bold in this beaded fringe silhouette. It's a seriously fun slay.\r\nYou've got your crewnecks and hoodies on lock. Now it's time to treat yourself to an oversize collar half-zip that looks a little more polished than all the rest. This one comes in a range of colors, but right now charcoal is speaking our cozy-chic language.\r\nReal talk: Snow gear can be super-bulky and tricky to maneuver. But whether you're suiting up for a tubing or ripping down the slopes, this one-piece is a legit winner. Take your pick from 10 different color options (but low-key, the almond is the move for an on-point neutral color palette).\r\nWho would be happy enough to buy you a warm shining diamond pendant? Why, it's you. This one has beautiful energy (praise!) and, in true Sorellina fashion, comes in a range of scales.\r\nClogs are life. We won't be taking questions. Ensure a cozy pair is in your lineup by scooping up this shearling-lined version of Birkenstock's iconic Boston."
    },
    {
        "source":{
            "id":null,
            "name":"Fast Company"
        },
        "topics": "Society",
        "author":"Next Big Idea Club",
        "title":"This is how we design the antidote to cancel culture",
        "description":"Free speech culture can be encapsulated in idioms that were once core to the American identity, such as to each their own, walk a mile in a man’s shoes, and everyone’s entitled to their own opinion.\n\nBelow, coauthors Lukianoff and Schlott share five key insig…",
        "url":"https://www.fastcompany.com/90990013/antidote-to-cancel-culture",
        "image":"https://images.fastcompany.net/image/upload/w_1280,f_auto,q_auto,fl_lossy/wp-cms/uploads/2023/12/p-1-90990013-defending-free-speech.jpg",
        "date":"2023-12-01",
        "content":"Below, coauthors Lukianoff and Schlott share five key insights from their new book, The Canceling of the American Mind: Cancel Culture Undermines Trust and Threatens Us All—But There Is a Solution. Listen to the audio version—read by Schlott—in the Next Big Idea App.\r\n<h3>CANCEL CULTURE IS REAL AND AT A HISTORIC HIGH</h3>\r\nBelieve it or not, neither Greg nor I like the term cancel culture. It’s been abused and dragged through the mud, but we agreed to use it anyway for a simple reason: It’s a term the vast majority of Americans know, and using terminology that doesn’t speak to the typical person would be a waste of time. We define cancel culture as the measurable uptick beginning around 2014 of campaigns to get people fired, expelled, deplatformed, or otherwise punished for speech that is or would be protected by the First Amendment.\r\nDespite what many might claim, cancel culture is very real and happening at a historic scale. In his 22 years defending academic freedom at the Foundation for Individual Rights and Expression (FIRE), Greg has seen it firsthand time and again.\r\nIn the last decade, FIRE has tallied 1,000 attempts to get professors fired or otherwise targeted for their speech. About two-thirds of those attempts succeeded in getting them punished in some way, and almost 200 professors got fired. That’s twice as many professors as were fired during the Red Scare. In fact, there’s no historical comparison since academic freedom was legally established. People saying cancel culture isn’t happening are being willfully blind.\r\n<h3>CANCEL CULTURE IS WINNING ARGUMENTS WITHOUT WINNING ARGUMENTS</h3>\r\nCancel culture lets you off the hook from actually refuting ideas you don’t like by allowing you to attack the person presenting the idea instead. Counselors shrug off the responsibility of actually engaging in a meaningful, substantive, and intellectual way. Abusing ad hominem attacks is a way to avoid arguments and avoid being proven wrong or finding any common ground. Cancel culture is so common because it’s so effective. It makes an example of any person who was targeted. Taking away someone’s platform or career makes it more likely that no one else will dare to tread the same ground.\r\nThe looming threat of being torn down creates a culture of fear and conformity. It’s an extremely effective way to squelch out dissenting voices. This is something that I saw as a college student just a couple of years ago. Very few people dared to challenge prevailing viewpoints on campus. It was only after I began sharing my views publicly in op-eds that I realized how many people were quietly biting their tongues. Countless people reached out to say, “I agree with you, and thanks for saying that, but please don’t tell anyone we had this conversation.”\r\n<h3>THE PERFECT RHETORICAL FORTRESS</h3>\r\nBoth the political left and right engage in their own forms of cancel culture and dysfunctional methods of argumentation. We use a metaphor of rhetorical fortresses to describe the way each side insulates themselves from inconvenient arguments.\r\nThe left’s version is called the perfect rhetorical fortress. It’s an intricately constructed series of walls that protect those inside from having to engage with someone’s point by boxing out the speaker based on personal attributes. The first wall lets you tune out anyone who’s conservative regardless of what they have to say. Then comes layer after layer of demographic eliminations. Is the speaker white? Are they straight? Are they cisgendered? You can use all these characteristics to avoid having to take into account their point of view.\r\nThe perfect rhetorical fortress is an enormously effective way to tune out any idea that challenges your own point of view. Sadly, it distracts us from debating each other’s viewpoints or, better yet, finding common ground.\r\n<h3>THE EFFICIENT RHETORICAL FORTRESS</h3>\r\nWe dubbed the right wing’s equivalent the efficient rhetorical fortress because, well, it’s far more efficient and a lot less of an elaborate construction. Those inside the right’s fortress protect themselves with just a few walls. If someone’s a liberal, an expert, or a journalist, they’re simply not worth listening to. And those in the MAGA wing add an additional layer that blocks out anyone critical of Trump. If you can label someone as woke in any way, shape, or form, then they’re totally done.\r\nSome people who we know personally who are quite right-wing have been called woke or RINO (Republican in name only), for deviating even a little bit from the current right-wing orthodoxy. People like David Frum and David French come to mind here. Someone who concedes that there are problems in policing, for example, or who denies that the 2020 presidential election was stolen can immediately have their conservative credentials revoked and get totally tuned out. That’s the entire point of the rhetorical fortresses. They let you win arguments without actually winning arguments and attack your opponent rather than debate them.\r\n<h3>THERE’S A WAY TO PUSH BACK AGAINST CANCEL CULTURE</h3>\r\nFree speech culture is the antidote to cancel culture. Free speech culture can be encapsulated in idioms that were once core to the American identity, such as to each their own, walk a mile in a man’s shoes, and everyone’s entitled to their own opinion. We all need to do our part in re-embracing these values that underpin a diverse, pluralistic, and healthy society.\r\nThe solution is simple, but it’s often difficult in practice. Commit yourself to arguing toward truth, avoid the cop-out of ad hominem attacks, and focus on the argument, not the person. That way we can engage in meaningful debate about contentious issues and learn from one another. In the words of John Stuart Mill, “He who knows only his side of the case knows little of that.”\r\nWe all must do our part to help maintain a free speech culture. If we get complacent, we may succumb to all the forces constantly working against the maintenance of a free society.\r\nGreg Lukianoff is an attorney and the president of the Foundation for Individual Rights and Expression (FIRE). His writing has appeared in The Washington Post, The New York Times, The Los Angeles Times, The Wall Street Journal, The Boston Globe, and other publications. He is a regular columnist for The Huffington Post and has appeared as a contributor on TV shows including CBS Evening News, Fox & Friends, The Today Show, and Stossel. He received the 2008 Playboy Foundation Freedom of Expression Award and the 2010 Ford Hall Forum’s Louis P. and Evelyn Smith First Amendment Award on behalf of FIRE.\r\nRikki Schlott is a journalist and political commentator. She is a research fellow at the Foundation for Individual Rights and Expression (FIRE), host of the Lost Debate podcast, a columnist at the New York Post, and a regular contributor to numerous publications and television programs. Her commentary focuses on free speech, campus culture, civil liberties, and youth issues from a Gen Z perspective."
    },
    {
        "source":{
            "id":null,
            "name":"Scientific American"
        },
        "topics": "Society",
        "author":"Lucy Tu",
        "title":"A Black Physician Takes on Racism in Medicine",
        "description":"Physician Uché Blackstock talks about her experience of the huge health disparities faced by Black Americans in her new book Legacy",
        "url":"https://www.scientificamerican.com/article/a-black-physician-takes-on-racism-in-medicine/",
        "image":"https://static.scientificamerican.com/sciam/cache/file/679FFF86-E94F-4384-9E70FEBED93FDCC5_source.jpg?w=1200",
        "date":"2023-11-20",
        "content":"Growing up, Uché Blackstock and her twin sister, Oni, watched their mother lead an organization of Black female physicians. Inspired by their mother’s example, the sisters pursued careers in medicine and made history as the first Black daughters of a woman who graduated from Harvard Medical School to earn a degree at that institution. When their mother died of leukemia at the age of 47, they were determined to carry on her legacy.\r\nUché Blackstock, who is founder and CEO of Advancing Health Equity, chronicles her journey in medicine and sheds light on pervasive inequities within the U.S. health care system in her forthcoming book Legacy: A Black Physician Reckons with Racism in Medicine, scheduled for release in January. The book, which is both a multigenerational family memoir and an unflinching critique of the American health care system, traces Blackstock’s growing awareness of the sprawling health disparities faced by Black Americans. Her battle for health equity found new urgency in the spring of 2020, when the COVID pandemic hit New York City. Amid the backdrop of the pandemic and the Black Lives Matter movement, Blackstock found renewed power as a health equity advocate. Now, even as the COVID federal public health emergency has ended, she says that there is still so much work to be done to tackle health inequity.\r\nScientific American spoke with Blackstock about her upcoming book, the impact of racial bias in health care settings and the actionable steps that health professionals and everyday people can take to promote health equity.\r\n[An edited transcript of the interview follows.]\r\n<h3>Why did you choose Legacy as the title of your book?</h3>\r\nTo me, Legacy has a double meaning. There is the legacy of my twin sister and me continuing the mission of our mother’s work. But there is also the legacy of deeply entrenched systemic racism in this country, which has led to Black people’s lives being harmed and even shortened. People often see racial health inequities today and say, “This is all based on individual habits,” as opposed to recognizing that what we are seeing is the culmination of centuries of systemic discrimination. My goal is to connect the dots for readers between this history and discrimination in health care settings.\r\n<b>In the book, you discuss several concrete instances of how racial bias manifests in health care, including racial disparities in maternal mortality and treatments for sickle cell disease. Can you walk us through one of those examples?</b>\r\nSickle cell disease is a very poignant example. In the U.S., sickle cell disease is more prevalent among Black people, and there is a disturbing history of nonconsensual medical research conducted on Black people to study the condition. During my medical residency, I discovered how, as a disease, it has been racialized and is now considered a “Black disease,” even though it’s not a disease that only impacts Black people. That racialization is reflected in the lack of funding for research to understand and treat sickle cell disease.\r\nIn my own practice, I have witnessed people, specifically Black people, with sickle cell disease constantly visit the emergency department because there were no systems in place to make sure they were proactively receiving treatment and follow-up care. Patients were often mistreated or disrespected because some of my colleagues were quick to label them as drug seekers searching for pain medication.\r\n<img class=\"image2\"src=\"https://static.scientificamerican.com/sciam/assets/Image/2023/9780593491287%5B38%5D.jpg?w=2000\"></img>\r\n<b>In one section of the book, you discuss a specific patient who repeatedly came to the emergency room, but your supervisor instructed you to turn them away because they were probably an “addict.” That was a very memorable and also difficult part of the book for me to get through.</b>\r\nI know. And I can tell you that it wasn’t just that one patient. There were so many other patients that had similar experiences. Within health care settings, patients are often dehumanized. And I don’t think anyone goes into health care or medicine with the goal of mistreating anyone. But because of the environment that health professionals are trained and educated in, we often hold these beliefs and don’t recognize that we’re holding them. When we interact with our patients, we end up ignoring them, minimizing their concerns and, in the process, dehumanizing them. It’s unconscionable that any patient experiences that.\r\n<b>In 2020 we saw the convergence of two major events—the COVID pandemic and the resurgence of the Black Lives Matter movement after George Floyd’s death. How did those events shift people’s perception of racism and health disparities in the U.S.?</b>\r\nThe moment I left academic medicine [in December 2019], I was on a mission to build my organization, Advancing Health Equity, and to close the gap on racial health inequities. And when the pandemic hit, I was initially shocked, like everyone else. But within a few weeks of working in urgent care, I noticed that all of the patients looked like me. And it just hit me: everything that you’re working for and toward at this moment is being magnified.\r\nIn that moment, the conversation around racial health inequities became even more nuanced. Instead of people ascribing these disparities to inherent differences in Black bodies or our biology, there was a conversation around housing, employment and access to transportation being a risk factor for being hospitalized or dying from COVID. For a long time, I felt that conversations about health equity in academia had been siloed. But in 2020 we began to have those conversations about systemic racism impacting the social determinants of health in the public world.\r\n<b>How can we turn those conversations into implementable interventions to address racism and health disparities?</b>\r\nThose conversations show us that interventions like improving patient protocols and integrating cultural competency into medical staff training are crucial components of the solution but not the sole ones. Reducing health disparities requires action outside of the hospital, too.\r\nAs an example, we should advocate for policies that strengthen workplace protections for essential workers or expand paid sick leave and family medical leave. These interventions actively contribute to reducing health disparities and generally reduce exposures to health risks long before people come to a hospital. There are opportunities for broad community involvement in these initiatives, too. These are policy interventions that people outside the health care sector can and should actively advocate for.\r\n<b>As a physician and now with your own organization, you’ve worked from inside and outside the health care system to advocate for greater equity. What other advice would you give people who have only been on the patient side of the health care system and hope to help advance health equity?</b>\r\nI would encourage them to reach out to groups like Be a Hero, which organizes everyday people to advocate for and implement policy solutions. Its founder, [the late] Ady Barkan, did local grassroots organizing around issues such as single-payer universal health care, which can improve health outcomes for all people. These kinds of organizations specifically target patients who have an interest in making a difference. I also think supporting health equity is about simply educating yourself on how we reached our current situation in the U.S., where we have some of the worst health outcomes of high-income countries. It’s about voting for people that advance policies promoting a healthy society.\r\nIn my book, I talk about my personal experiences as a Black physician—and, at times, as a patient—dealing with racism. It’s almost like living in two worlds: I know what it’s like to be a physician, but I also understand my patients’ distrust of the health care system. So my mission is to empower these patients and affirm their feelings while also making sure they know that there are health professionals and physicians out there that care deeply about them receiving the best care—the most dignified and respectful care that they deserve."
    },
    {
        "source":{
            "id":null,
            "name":"Phys.Org"
        },
        "topics": "Society",
        "author":"Science X",
        "title":"Living in a +50°C world: Cooling must be considered critical infrastructure, says new report",
        "description":"Experts from the University of Birmingham are calling for global cooling and cold chain to be considered as critical infrastructure as the planet continues to heat.",
        "url":"https://phys.org/news/2023-11-50c-world-cooling-critical-infrastructure.html",
        "image":"https://scx2.b-cdn.net/gfx/news/hires/2021/global-warming.jpg",
        "date":"2023-11-28",
        "content":"Experts from the University of Birmingham are calling for global cooling and cold chain to be considered as critical infrastructure as the planet continues to heat.\r\nThe report, \"The Hot Reality: Living in a +50°C World,\" comes as world leaders, businesses, scientists, and environmental agencies gather in Dubai for the start of COP 28.\r\nThe Hot Reality: Living in a +50°C World project is led by the Center for Sustainable Cooling and the Africa Center of Excellence for Sustainable Cooling and Cold-Chain (ACES) in Kigali, Rwanda.\r\nThe report outlines the need to formally designate cooling infrastructure systems as critical infrastructure, central to our climate adaptation strategy for a fast-warming world. It describes the benefits this would bring and proposes important next steps that must now be taken towards this vital goal.\r\nToby Peters, Professor of Cold Economy at the University of Birmingham and Heriot-Watt University, and one of the co-authors of the report said, \"The provision of cooling is not an optional extra or a lifestyle luxury. It is a critical service for a well-functioning, well-adapted, resilient, and healthy society, and economy, enabling access to the basic essentials of life, such as food and health, and providing safe environments to live, work, learn and play.\"\r\n\"However, despite cooling being vital to every nation's productivity, prosperity, and economic well-being, it is typically absent from lists of important national infrastructure.\"\r\nProfessor Peters added, \"In recent years we have seen record-breaking summer temperatures in the high 40°Cs and low 50°Cs being measured in places where this would have previously been unimaginable.\"\r\n\"As the world continues to warm our need to adapt to increasing seasonal ambient temperatures as well as more frequent, prolonged, and intense heat waves, the energy resources, equipment, assets, people, business and finance models and other components that form the infrastructure systems delivering the critical service of cooling will be at the core of adaption and resilience strategies.\"\r\nThe challenge is that cooling already accounts for already account for more than 7% of all GHG emissions. It is estimated that these emissions could double by 2030. Moreover, hydrofluorocarbons (HFCs) are the fastest-growing source of GHG emissions in the world because of the increasing global demand for space cooling and refrigeration.\r\nDr. Leyla Sayin, Deputy Director for the Center for Sustainable Cooling, said, \"Cooling's central role to the economic functioning of society, as well as its impact on energy, demands that it should be a distinct cross-cutting sector within the suite of 'economic infrastructure' considered by Governments, particularly in the context of future climate change and the impact of higher temperatures. Taking a high-level, holistic, whole systems thinking approach is a prerequisite for an optimized outcome to planning, building, operating, maintaining, adapting, and decommissioning such infrastructure sustainably.\"\r\nThe report sets out five main recommendations to improve adaptability to our rapidly heating planet.\r\n<ol><li>National governments and international governance bodies worldwide should recognize that cooling is a critical service and designate the infrastructure which delivers it as critical infrastructure.</li><li>National governments should develop integrated, future-proofed strategies for adaptation to climate change-induced heat impacts with the provision of sustainable cooling infrastructure at their core, including policies based on a comprehensive assessment of the food, health, digital industrial and economic security implications of sustainable cooling for their citizens.</li><li>Governments, infrastructure designers, developers and operators, and academia should take a holistic, whole systems thinking approach to planning, building, operating, maintaining, adapting, and decommissioning cooling infrastructure.</li><li>Governments, academia, infrastructure designers and civil society should recognize that the majority of the energy services required to support a modern society are thermal and adopt a thermal thinking approach to energy system policymaking, research, and design worldwide.</li><li>Governments need to quantify the wider social impact of the cold chain to understand their stakeholder role and justify active investment in the development of the cooling and cold chain as a part of the country's critical infrastructure.</li></ol>\r\nProfessor Peters concluded, \"A lot of work needs to be done now, on the global cold chain and cooling infrastructure to meet the myriad of challenges that living in a +50°C world presents. We simply do not have the luxury of time to put this off. We need to realize that treating cooling as critical is a matter of survival.\""
    },
    {
        "source":{
            "id":null,
            "name":"The New York Review of Books"
        },
        "topics": "Society",
        "author":"Linda Greenhouse",
        "title":"An Unhealthy Definition of Rights",
        "description":"For the new majority on the Supreme Court, religious liberty takes precedence over the government’s power to protect public health.",
        "url":"https://www.nybooks.com/articles/2023/12/21/an-unhealthy-definition-of-rights-constitutional-contagion-parmet/",
        "image":"https://www.nybooks.com/wp-content/uploads/2023/11/greenhouse_1-122123-900.jpg",
        "date":"2023-11-30",
        "content":"The public health profession uses the term “social determinants of health” to describe the social conditions that combine to influence the health of individuals and communities. These include such measurable elements as education, housing, and economic stability as well as environmental quality, structural racism, and other forms of systemic discrimination, some of which are less quantifiable. In Constitutional Contagion, Wendy Parmet demonstrates that among these elements we also need to include law.\r\nIt was a given that legal issues would arise in the course of the US response to the Covid-19 pandemic. In the spring of 2020 governors and mayors almost immediately drew on explicit or assumed legal authority to issue shutdown orders and impose other mitigation measures, even as the public health response became fuel for the country’s political polarization. By mid-2021, barely more than a year into the crisis, more than a thousand lawsuits had been filed against pandemic restrictions and mandates, and the Supreme Court had abruptly reversed itself and begun accepting religious objections to such measures rather than the recommendations of those whose job was to keep the public safe—with major doctrinal consequences that are still unfolding.\r\nParmet, a law professor at Northeastern University who has written widely on public health, recounts these developments, but her goal is deeper: to illuminate the currents in American legal culture that contributed to what she deems the country’s “catastrophic response” to the pandemic. She places on display an American exceptionalism of a particularly disquieting form: a legal mindset that has come to value individual freedom over communal welfare and so has “lost sight of contagion’s most compelling lesson: Our own health depends on the health of others.”"
    },
    {
        "source":{
            "id":null,
            "name":"Americanthinker.com"
        },
        "topics": "Society",
        "author": "Eric Utter",
        "title":"Jack Smith, DOJ implicitly threaten Trump-supporters",
        "description":"The redacted warrant sparked outage [sic] among many social media users, as it requested “lists of Twitter users who have favorited or retweeted tweets posted” by Trump, “as well as all tweets that include the username associated with the account (i.e. ‘mentions’ or ‘replies’).”",
        "url":"https://www.americanthinker.com/blog/2023/11/jack_smith_doj_implicitly_threaten_trumpsupporters.html",
        "image":"https://www.americanthinker.com/images/bucket/2023-11/250462.jpeg",
        "date":"2023-11-30",
        "content":"Welcome to Oceania.\r\nBig Brother is watching you.  Or should I say Uncle Sam is, in the guise of the Biden administration.  (The World State will be along soon enough.)\r\nAccording to Newsweek:\r\nAs Monica Showalter stated in her American Thinker post of Nov. 29, “This means many of you may have been targeted.”  She added that Jack Smith also demanded Trump’s drafted tweets as well as his D.M.s.\r\nJack Smith is deranged by hatred of Trump.  In a healthy society, one subject to an equally applied rule of law, he would promptly be held accountable for his unconstitutional actions and the massive breach of Americans’ First Amendment rights.  But let’s face it: the Biden administration is fine with this, has signed off on it...may have even pre-approved of it.\r\nCan you imagine Ronald Reagan, or even any of today’s Republican candidates, doing this if in office?\r\nMost Republicans are clueless, impotent, or okay with the status quo.  Conservatives are so far behind Democrats in the race to Washington that they can’t even see the donkey’s rear end.  In one sense, this is a good thing.  We don’t want to be like them.  However, Republicans must summon the will to stop Democrats from cheating, breaking the law, etc., etc., so they don’t feel pressure to do the same things.  Democrats abuse the Constitution like how Nancy Pelosi abuses a Trump State of the Union speech.  Truth be told, many of them would rip it up on national television if they believed that it wouldn’t cost them any votes.\r\nThe state is essentially saying to Trump-supporters, “We have your tweets.  We have your ballots.  We know whom you voted for.  We have no choice but to take certain measures to...preserve our cherished democracy.”  (I picture a late 1930s- or early 1940s-era Nazi with a red armband saying this.  But maybe I should just picture Biden in his “Blood Red Background Speech” of August 31, in which he verbally assaulted MAGA Republicans.)\r\nChilling doesn’t begin to describe this.  This kind of behavior cannot stand.  The only proper response to this was Lara Logan’s: “Hey Jack Smith — on behalf of all free Americans let me save you the trouble of getting my info from Twitter: go f--- yourself.”"
    },
    {
        "source":{
            "id":null,
            "name":"The Daily Caller"
        },
        "topics": "Society",
        "author":"Mary Rooke",
        "title":"ROOKE: Why Are So Many American Men Killing Themselves? The Answer’s Obvious",
        "description":"American men are killing themselves at higher rates than at any time in history, and it&#039;s our fault.",
        "url":"https://dailycaller.com/2023/11/29/rooke-so-many-american-men-killing-themselves-answers-obvious/",
        "image":"https://cdn01.dailycaller.com/wp-content/uploads/2023/11/GettyImages-1776756100-scaled-e1701313428606.jpg",
        "date":"2023-11-30",
        "content":"American men are killing themselves at higher rates than at any time in history, and it’s our fault.\r\nForty-four out of every 100,000 men aged 75 and older commit suicide in the U.S. For younger American men, the odds are not much better, with over 30 deaths per 100,000 among those aged 25-35.\r\nThe National Center for Health Statistics found the number of suicides in the U.S. reached a record increase in 2022, with men experiencing the highest rates of suicide compared to their female counterparts. While these deaths decreased slightly in the youngest age groups, they spiked in every category of men aged 35 and older.\r\n<img class=\"image2\"src=\"https://pbs.twimg.com/media/GAGncJyXwAIPvUh?format=jpg&name=small\"></img>\r\nIt’s not hard to see why American men resort to suicide. Our society doesn’t provide them with a purpose anymore. From the moment men are born, they hear feminists cry about man’s inherently evil nature. They learn early on that the world views them as a toxic menace. Their only function in society is to support their female counterparts. Outside of that, their ambitions, hobbies, and passions are meaningless.\r\nA healthy society teaches its men that their divine creation requires them to take charge of this Earth. Their ability to provide security and protection allows women the freedom to find fulfillment and love.\r\nStop raising boys to be kind and begin to explain to them their duty is to lead honorably. Good men are a blessing to our sex, and they understand their purpose is to protect and care for us physically, emotionally, and spiritually. They don’t just have the obligation to be kind, but also mean and deadly.\r\nThe answer to why American men are killing more of themselves every year is the same as to why the liberal woman can’t find a good man. Our society is so focused on ensuring women can achieve everything a man can that we’ve given up on raising worthy men.\r\nLiberal women are the first to notice the issues because their liberal men experience the most abuse. Conservative boys aren’t raised to hate themselves the way progressives are. It’s easy to recall the viral video of the progressive woman complaining about the lack of masculine progressive men in her dating pool. These women are like perpetrators returning to the scene of the crime, acting like they have no idea how it happened. <b>(ROOKE: The ‘Body Count’ Debate Proves The Nightmare Of Childless Feminists Is Yet To Come)</b>\r\nOur society has stripped men of their ability to fight for a cause. Look at the way we are treating former U.S. Marine Daniel Penny. He saved a bunch of NYC train riders from a violent, mentally ill man. He should have been given a ticker-tape parade and the key to the city, but instead, NYC is making him fight for his life in the unjust court system. Men see what happened to Penny and make the logical decision to sit out of the fight, resulting in innocent people dying.\r\nWe’ve consistently told men they have no future but death. Their legacies supported the patriarchy. Their battles were meaningless appendage-measuring contests. Women find them annoying and useless. It’s no wonder as men age and their lives become less and less important to society, they’ll be depressed and suicidal. Why would anyone want to fight for a world that tells them they are meaningless?\r\nAs with all our sufferings, we don’t have to live in a world so bleak as to view men this way. Our society should be striving to bring them back to their purpose because the only alternative is to ignore the rising death tolls.\r\n<i>Mary Rooke is a reporter at the Daily Caller and host of “Trad-ish with Mary Rooke.”</i>\r\n<i>The views and opinions expressed in this commentary are those of the author and do not reflect the official position of the Daily Caller.</i>"
    },
    {
        "source":{
            "id":null,
            "name":"People.cn"
        },
        "topics": "Society",
        "author":"F_400991",
        "title":"Pakistani president reaffirms commitment to safeguarding children's rights",
        "description":"Pakistan's President Arif Alvi on Monday reaffirmed the country's commitment to safeguarding the rights and well-being of its children.",
        "url":"http://en.people.cn/n3/2023/1120/c90000-20100023.html",
        "image": "https://imgproxy.newswav.com/1000x0,q50=/https://thesun.my/binrepository/lbgf5fpfpzkvxfliwdduxctehy-3062522-20230325112836_3653033_20231120180126.jpg",
        "date":"2023-11-20",
        "content":"(Xinhua) 16:24, November 20, 2023\r\nISLAMABAD, Nov. 20 (Xinhua) -- Pakistan's President Arif Alvi on Monday reaffirmed the country's commitment to safeguarding the rights and well-being of its children, highlighting that children are the most precious resource of any nation and the sole guarantee of its future.\r\n\"Pakistan is fully alive to its responsibilities towards its children and is making all efforts to ensure children's inclusive development, education, health care, participation, dignity and security,\" the president said in a message on World Children's Day.\r\nIn accordance with national and international obligations, Alvi said Pakistan has a clear vision of investing in children and has remained at the forefront of advocating, protecting, and promoting child rights.\r\n\"Pakistan is a signatory to seven core international human rights conventions, including the United Nations Convention on the Rights of the Child ... We believe that social justice and equality are the cornerstones on which the structure of a healthy society is built,\" he said.\r\nCommenting on the challenges, Alvi said that children in Pakistan are vulnerable to stunting, malnutrition, and lack of access to quality education and health facilities, in addition to various protection challenges including child trafficking, child marriage, child labor, and child abuse.\r\nIn this regard, the government has been stepping up efforts to enact policies and promulgated a number of legislations to protect children's rights and create an enabling environment for them, he added."
    },
    {
        "source":{
            "id":null,
            "name":"Antaranews.com"
        },
        "topics": "Society",
        "author":"Sean M, Kenzu",
        "title":"Healthy society among requirements for advanced Indonesia: Minister",
        "description":"Minister of Health Budi Gunadi Sadikin emphasized that a healthy society is one of the requisites to become a developed nation.\r\n\"I want Indonesia to become a high-income country that our children and grandchildren can ...",
        "url":"https://en.antaranews.com/news/299133/healthy-society-among-requirements-for-advanced-indonesia-minister",
        "image":"https://cdn.antaranews.com/cache/1200x800/2023/11/21/WhatsApp-Image-2023-11-21-at-12.32.34.jpeg",
        "date":"2023-11-21",
        "content":"Jakarta (ANTARA) - Minister of Health Budi Gunadi Sadikin emphasized that a healthy society is one of the requisites to become a developed nation.\r\n\"I want Indonesia to become a high-income country that our children and grandchildren can enjoy. We have to make sure that residents in any regions are healthy and smart,\" Sadikin noted in a written statement here on Tuesday.\r\nThe minister underscored the need for Indonesia to make the most of the peak of the demographic bonus in 2030 by preparing quality, healthy, and smart human resources.\r\nAccording to Sadikin, health is a fundamental right that should be prioritized.\r\nThe minister stated that one of the efforts to realize a healthy Indonesia is implementing several programs on health transformation, especially the pillar of primary care transformation.\r\nSadikin affirmed that a healthy community is one of the capitals in welcoming the demographic bonus that Indonesia will experience in 2030.\r\n\"To create a healthy population, we must make them happy and focus on public health services in local health centers rather than hospitals,\" he stated.\r\nThe minister emphasized that health promotion efforts should be intensified rather than letting people fall ill and shell out money for expensive treatments.\r\nSadikin believes that national health transformation is not easy, as it is correlated to several other sectors, such as food, agriculture, environment, education, and finance, which are sometimes tricky to balance.\r\nHence, to this end, the minister stated that transformation of the health system requires collaboration with several partners in other sectors and stakeholders.\r\n\"Therefore, I would like to reiterate that the Ministry of Health seeks to strengthen collaboration with partners to support the health system transformation,\" he stated.\r\nSadikin cautioned that if Indonesia fails to capitalize on the demographic bonus, it will remain stuck in the middle-income trap forever."
    },
    {
        "source":{
            "id":null,
            "name":"Psychology Today"
        },
        "topics": "Relationships",
        "author":"Amy Banks",
        "title":"What Does It Mean to Be Wired for Love?",
        "description":"A Personal Perspective: The fact that connections, these new, healthy relationships, born of the darkest human circumstances, gave their lives meaning and purpose is extraordinary.",
        "url":"https://www.psychologytoday.com/intl/blog/wired-for-love/202312/what-does-it-mean-to-be-wired-for-love",
        "image":"https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_91_1_1528x800/public/teaser_image/blog_entry/2023-12/the-heart-of-reconciliation-faith-community-and-transformative-action-transparent.png.jpg?itok=ED9hwALq",
        "date":"2023-12-01",
        "content":"Personally, it has been a very long year. I have been out on medical leave, having had two septic knees, three major knee surgeries, too many antibiotics, and a ton of downtime to think and feel. My astrologer says it is what is meant to happen—my body insisting that I slow down, shift gears, and find a new, less compulsive path for my passions. I have tried to listen.\r\nOne thing that kept popping up in the absence of work was my honest confusion about relationships and how to make sense of them in this increasingly divided and violent world. I don’t pretend to have the answers. But would like to share some basic observations. Perhaps food for thought for others to build on.\r\nThere were many times in the isolation of illness that I did not feel “wired for love.” My subjective pain and suffering were so linked to my sympathetic nervous system that I often felt like digging a hole, crawling in, and never coming out. I suspect I am not alone in that feeling. Inevitably, I would come out, and nine times out of ten, it was because one of my dear friends or family members would send me a message over email or text or even visit, and somehow, that would light a spark.\r\nNot a raging blaze but a spark that had the power to ironically douse the fire of isolation and pain burning in my sympathetic nervous system just long enough for me to peek out of my hole and notice that life was still going on around me. Neighbors were walking their dogs, family and friends were gathering for meals and companionship, and it was a way to manage the overwhelming news of emerging wars, the escalation of political discord, and the ominous threat of climate change.\r\nFor me, each reemergence felt like a small miracle—a relational balm to break the cycles of pain consuming me. Inevitably, I would go back to my hole. Healing can be like this: A stutter step into health and a retreat back into the relentless energy needed to heal wounds—emotional and physical.\r\nWhen I finally emerged in September with a newly replaced knee, my first event was to attend a New England Innocence Project fundraiser with a dear friend. The stories shared at the event by three people directly impacted by a wrongful conviction were deeply moving and awe-inspiring.\r\nNancy Wagner shared her heart-wrenching story of being wrongly convicted of murdering her baby. She was imprisoned for 30 years before her legal team established evidence that she was not responsible for her child’s death. Thirty years. Healing from the death of a child is nearly impossible.\r\nBut to grieve while you are isolated from family and friends and accused of murder is unimaginable. Another speaker, Jabir Pope, was wrongfully convicted of killing a man in Boston and spent 38 years in prison before he was acquitted by the discovery of exculpatory evidence withheld during his trial. He shared an agonizing story of one brutal day in his thirty-eight years of hell. The day his mother was dying.\r\nHe simply wanted to hear her voice one last time but was turned down for a phone call by the warden, who suggested he ”find a phone” on the unit (something that was clearly illegal and could land him in solitary confinement). He risked total isolation at the very time he needed people to comfort him as he was losing his mother. He took his chances and made the call.\r\nNo one, wrongfully convicted or even rightfully incarcerated, should be faced with the inhumane choice he was forced to make. And Yesinia Valentin talked of her mission to get her father out of a wrongful conviction, sharing the impact his wrongful conviction had on her family.\r\nThey had been homeless numerous times during her childhood. Now, with a child of her own, she has done everything in her power to build a sense of security for the two of them. She proudly announced she had recently purchased a house, sharing the sense of safety the house provides for her and her son. Despite the injustice to her family, she fulfilled her dream of becoming a homeowner and building a sense of safety that she never had as a child.\r\nHer current dreams include running for political office to change policies that negatively impact people of color. Listening to her strength, passion, and desire to shape a safe world for all people seemed to fill the audience with a sense of direction and purpose.\r\nEach story shared was powerful, enraging, and heartbreaking. Even though each of these folks had been betrayed by the justice system, two wrongly villainized as dangerous criminals, they stood on stage sharing their experiences and what helped them through the unimaginable.\r\nWhat kept Nancy Wagner going during those 30 long years of exile, and what keeps her going now as she builds a life after three decades of wrongful conviction? Relationships. In her words, it is her connection with her partner, Ray. Each of the speakers gave voice to the community of exonerees and those who helped them escape anyone’s worst nightmare. The fact that connections, these new, supportive, healthy relationships, born of the darkest human circumstances, gave their lives meaning and purpose is extraordinary.\r\nHelping others, sharing their stories, and supporting one another heal the wounds and allow them to take steps forward in building new lives. I realized that night, as I crawled out of my relatively small hole of isolation, that yes, we, as human beings, are indeed wired to love. As mysterious as it may sometimes seem, supportive relationships have the power to heal the most devastating of human pains. And for that, I am grateful."
    },
    {
        "source":{
            "id":"abc-news",
            "name":"ABC News"
        },
        "topics": "Relationships",
        "author":"Yi-Jin Yu",
        "title":"Wisconsin couple adopts foster daughter after 3 years",
        "description":"A Wisconsin couple has adopted their foster daughter after three years this November, which also happens to be National Adoption Month.",
        "url":"https://abcnews.go.com/GMA/Family/wisconsin-couple-adopts-foster-daughter-after-3-years/story?id=105043713",
        "image":"https://i.abcnewsfe.com/a/568289a6-1ad3-400e-a4ad-7e337bc3c2b0/adoption-zari-miller-ht-lv-231122_1700664451294_hpMain_16x9.jpg?w=992",
        "date":"2023-11-22",
        "content":"A Wisconsin couple has adopted their foster daughter, three years after she first arrived at their home in Wauwatosa.\r\nMandi and Ben Miller were there at Milwaukee's Vel R. Phillips Youth & Family Justice Center (Children's Court Center) with 3-year-old Zari for the big day on Nov. 17.\r\n\"November is [National Adoption Awareness Month]. And then Nov. 18 is National Adoption Day, and so our county celebrated it on Nov. 17.,\" Mandi Miller told \"Good Morning America.\" \"We had our parents and some aunts and cousins in the room, which was really nice. It was a 20-minute ceremony in the courtroom. But it was almost a little surreal because so much changed. She's legally ours forever and ever and ever, and yet she is still the same kid. She's still Zari.\"\r\nZari first arrived at the Miller home when she was just 4 weeks old, after she was discharged from the neonatal intensive care unit amid the coronavirus pandemic.\r\n\"I got a call in the middle of the night on Nov. 12, 2020, seeing if I would take emergency placement of a new baby. And I said, 'Yes,'\" Mandi Miller, 38, recalled. \"So, she arrived about 45 minutes later [on Nov. 13], which happened to be on my birthday.\"\r\n<img class=\"image2\"src=\"https://i.abcnewsfe.com/a/baf1a2ce-8852-4d10-881b-dd93768ee6bc/zari-miller-ht-lv-231122_1700664543068_hpEmbed_3x4.jpeg\"></img>\r\n\"At first, when I met Zari, I was just kind of scared and nervous about a newborn baby being around -- and then fast forward a few months later, I also became licensed [to be a foster parent],\" Ben Miller, 33, added. \"And then we are here now, three years later.\"\r\nIn the years since, the Millers, who are now parents of five, said Zari has grown into a \"very kind and loving\" toddler who's also \"curious,\" \"adventurous\" and \"very independent.\"\r\n\"She wants to just be buddies with everybody,\" Ben Miller said. \"She can act a little shy but she's also just ready to roll, so she's got a lot of really nice qualities -- a fun little kid who loves to play dress up, loves adventures and being outside.\"\r\n<img class=\"image2\"src=\"https://i.abcnewsfe.com/a/cb949654-b7e0-4c04-b89f-30816a432129/zari-miller-ht-lv-231122-2_1700664543219_hpEmbed_17x14.jpeg\"></img>\r\nToday, Mandi Miller said their home is \"usually loud with laughter and playing\" but she wouldn't have it any other way, since she has wanted to be a foster parent since she was in high school and met a foster family.\r\n\"A lot of our time is spent bonding with them, snuggling and curling up with books or laying in bed with them at night and just establishing healthy relationships in a family when that hasn't always been their model,\" Mandi Miller said.\r\n<img class=\"image2\"src=\"https://i.abcnewsfe.com/a/bfaaf4de-f5c5-455f-9780-d74069a9c6f3/zari-miller-ht-lv-231122-4_1700667655825_hpEmbed_3x4.jpeg\"></img>\r\nIn sharing their family's story, the Millers hope to encourage others to consider fostering children or supporting foster families, and to research trauma and gentle parenting as well.\r\n\"These kids need direction and help more so than ... just a biological child, if you have one,\" Ben Miller said. \"There are a lot of deep little things you've really got to learn and you gotta be able to roll with the punches.\""
    },
    {
        "source":{
            "id":null,
            "name":"HuffPost"
        },
        "topics": "Relationships",
        "author":"Eric FitzMedrud",
        "title":"I Help Couples Improve Their Sex Life. Here Are The 4 Things I Wish More Men Knew.",
        "description":"\"Because I’ve made these mistakes myself, I know I want to be loving, kind and generous. Most of my clients do, too.\"",
        "url":"https://www.huffpost.com/entry/couples-sex-therapy-consent-improve-relationships_n_654acbcfe4b0e3ecaf8b52b9",
        "image":"https://img.huffingtonpost.com/asset/654b726c24000071155534c0.jpeg?cache=XQ3fXDUmDS&ops=1200_630",
        "date":"2023-11-12",
        "content":"Imagine a new couple in their early 20s. Their relationship is fraying at the edges. She complains that if she doesnt have sex with him, he mopes for days. If she does have sex with him, hes happy for a few days before he begins complaining again.\r\nHe reports feeling lonely, that she’s not prioritizing their relationship, and that he’s tried everything to spark her desire, but nothing works. He has two affairs in a year. She’s devastated and betrayed.\r\nIf my wife and I had been wise (and wealthy) enough to go to couples therapy at the lowest point in our marriage, this is how a therapist might have described us.\r\nShortly after my second affair, shocked and ashamed by my behavior, I began to read books about relationships, got into a men’s support group, started going to therapy, and expanded my friend circle so that my sexual relationship didn’t have to meet all my needs for human connection. Today, I provide therapy for couples in the area of relationships, sex and consent. In particular, I help men improve their relationships.\r\nBecause I’ve made these mistakes myself, I know I want to be loving, kind and generous. Most of my clients do, too. Here are four things I wish more men knew about consent.\r\n<span class=\"strong\">Pressure kills desire.</span>\r\nI used to express feelings of rejection, resentment and hopelessness because my wife and I “had not had sex in so long.” My wife would then go to the calendar and identify the numerous times we’d had sex recently. I could see she was right, but I also couldn’t change my feelings, because I was dependent on her to change my mood. This inability to soothe my emotions created sexual pressure for her.\r\nThis is a dynamic I see in my office regularly. When you can’t regulate your emotional responses when a partner declines your offers for sex, the emotional consequences of turning you down creates pressure for your partner. This negative pattern then taints any invitation, offer or initiation of sex inside a relationship. When your partner feels pressured, there’s no room for them to have their own desire, because your desire is taking up all the attention.\r\n<span class=\"strong\">The absence of no is not the same as the presence of yes.</span>\r\nOne of the most common questions I get about this is whether ensuring you receive explicit consent will interrupt the flow of a sexual experience. But that should be the least of our worries. Do you know what interrupts the flow? Feelings of hurt and violation.\r\nWhile learning consent communication, it may be awkward. But as you get more proficient in consent skills, it will interrupt the flow less, it will get sexier, and you will eventually find that it is a part of the flow with this partner. There will be a smaller learning curve with the next partner, as there is with everything in a new relationship.\r\n<img class=\"image2\"src=\"https://img.huffingtonpost.com/asset/654cfe7c240000c6165535de.jpg?ops=scalefit_720_noupscale&format=webp\"></img>\r\n<span class=\"strong\">Don’t get defensive.</span>\r\nMen, even if you think you’re a “good guy” who would “never do anything like that,” you need to understand that men’s violence against women is pervasive. There’s a reason that women are afraid of men. They have more than likely been a victim of a man’s violence or threats, or are close to a woman who has been a victim of a man’s violence.\r\nIf your partner is trying to navigate around past trauma, you can collaborate by asking a new partner, “Is there anything you need me to do, or not to do, to help you feel safe throughout this process?”\r\nIf you do trigger their trauma, even inadvertently, don’t get defensive.\r\nI once decided to go for a walk in a recent ex-partner’s neighborhood. Coincidentally, my recent ex sent me a text asking me where I was and I replied that I was down the street. Women readers have probably gasped.\r\nWhen this triggered fears exacerbated by her experience with a past stalker, I acknowledged that I had made a mistake, apologized, left, and didn’t repeat the error. She later thanked me for changing my behavior and helping her feel safer. If I had gotten defensive, I’d have only worsened the situation.\r\n<span class=\"strong\">Consent is for you.</span>\r\nMen aren’t used to the idea that consent is for us. This is an essential lesson for us to learn.\r\nEighteen years into our marriage, my wife and I agreed, after almost two years of talking and preparing, to open our marriage to non-monogamy. As I became more confident dating as a polyamorous man, I learned I also needed to use consent to protect myself and my heart.\r\nI had a friend who expressed interest in me, but in her polyamorous relationships, there were some broken agreements and conflicts between partners. Most of those issues weren’t her fault, but they did affect her. This didn’t create a feeling of safety for me, so I said “no thank you” to her offers. But after engaging in many consent conversations, I eventually felt comfortable enough to negotiate a very memorable sexual relationship. I had protected myself with “no,” until “yes” felt right. If it stopped feeling right in the future, I knew I could return to “no.”\r\nConsent isn’t about trying to get consent from our partner. Consent is for people of all genders and all levels of desire. Consent makes us feel better about ourselves and our relationships. I hope to teach more men to prevent harm and increase their capacity to maintain healthy relationships."
    },
    {
        "source":{
            "id":null,
            "name":"Forbes"
        },
        "topics": "Relationships",
        "author":"Mark Travers, Contributor",
        "title":"3 Ways A ‘Ghostlighter’ Tries To Undermine You",
        "description":"Here’s how to protect yourself from the double whammy of an unexplained disappearance followed by an unannounced reappearance.",
        "url":"https://www.forbes.com/sites/traversmark/2023/11/12/3-reasons-why-ghostlighters-try-to-undermine-you/",
        "image":"https://imageio.forbes.com/specials-images/imageserve/654e7d5be74b1bfad5502c77/0x0.jpg?format=jpg&crop=1600,750,x0,y184,safe&height=900&width=1600&fit=bounds",
        "date":"2023-11-12",
        "content":"‘Ghostlighting,’ a term born from the fusion of ‘ghosting’ and ‘gaslighting,’ entails abruptly severing communication with someone, then returning to manipulate or deceive them by deflecting accusations of one’s disappearance onto factors other than oneself.\r\nSometimes, when someone who previously ghosted you reappears, it can seem like a second chance, making you feel valued and desirable. This can blind you to potential gaslighting or manipulation, leaving you vulnerable to negative and controlling behaviors.\r\nThe rollercoaster of emotions and self-doubt experienced by the target can be profoundly distressing. Repeated ghostlighting can erode trust, making it challenging to form healthy relationships in the future. Furthermore, continuous manipulation and gaslighting can significantly impact one’s self-esteem and self-worth. But what motivates ghostlighters? Here are three primary reasons why they do what they do.\r\n<hr>\r\n<span class=\"strong\">1. They Do It To Avoid Accountability</span>\r\nA primary motivation behind ghostlighting is the desire to shirk responsibility and accountability for one’s actions. Ghostlighters resort to this as a means to evade the consequences of their past decisions, particularly their abrupt disappearance.\r\nWhen they choose to reappear, it is often accompanied by fabricated explanations, excuses or even shifting the blame onto the other person. This manipulative behavior creates an environment where it becomes challenging for the affected individual to hold the ghostlighter accountable for their actions.\r\nAvoiding accountability allows them to bypass uncomfortable conversations and maintain a facade of innocence, protecting their ego and avoiding the repercussions of their actions. It’s a method to shield themselves from the weight of their own behavior and maintain a semblance of control over the narrative.\r\n<hr>\r\n<span class=\"strong\">2. They Do It For Manipulation And Control</span>\r\nGhostlighting is often driven by a desire for control. Ghostlighters might resort to isolation or disappearance to establish dominance over their target’s emotions and decisions. As ghostlighters want to hold the upper hand in the relationship, like any manipulator, when they reappear, they intentionally employ gaslighting techniques to sow doubt, insecurity and confusion, creating emotional instability in the target. A 2021 study published in Acta Psychologica links ghosting behavior to people possessing dark personality traits, who are known to be adept at exploiting ambiguous situations to their benefit.\r\nManipulation empowers ghostlighters with a false sense of control and influence, ensuring the other person remains emotionally dependent, often to fulfill their own desires for validation and control. It’s a means to perpetuate dominance in the relationship and foster a sense of superiority while keeping the other person emotionally entangled and unsure of themselves.\r\n<hr>\r\n<span class=\"strong\">3. They Do It As A Means Of Avoidance</span>\r\nAccording to a study published in Journal of Social and Personal Relationships, individuals with an avoidant attachment style can resort to emotional avoidance when they feel ill-prepared or unwilling to navigate complex emotions or confront challenging conversations. In situations where a relationship becomes entangled in complications or discomfort, ghostlighters opt for temporary withdrawal to evade addressing the underlying issues.\r\nThe act of reappearing at a later time allows them to uphold the connection while circumventing emotionally challenging discussions. Their act of avoidance often arises from their own unresolved emotional insecurities and a reluctance to engage in conversations that might lead to uncomfortable confrontations or expose their own vulnerabilities. In such cases, ghostlighting becomes a means of self-preservation, albeit at the expense of the other person's emotional well-being.\r\n<span class=\"strong\">Conclusion</span>\r\nGhostlighting is a harmful behavior that can have severe consequences for those on the receiving end. Understanding the reasons behind ghostlighting can help individuals recognize and protect themselves from such manipulation. It is crucial to be aware of the signs, set boundaries and prioritize one’s emotional well-being when confronted with ghostlighting. Remember that healthy relationships are built on trust, open communication and respect and you should settle for nothing less."
    },
    {
        "source":{
            "id":"time",
            "name":"Time"
        },
        "topics": "Relationships",
        "author":"Belinda Luscombe",
        "title":"Millions of Kids Have Been Taken In by Relatives. Soon Those Families Could Get Paid",
        "description":"The Biden Administration has instituted a new set of rules for kinship caregivers. Here's what they mean.",
        "url":"https://time.com/6338306/foster-care-kinship-caregivers-rule/",
        "image":"https://api.time.com/wp-content/uploads/2023/11/foster-care-relatives-family-2.jpg?quality=85",
        "date":"2023-11-22",
        "content":"On a Friday afternoon in 2005, at about 3 p.m., Mickey Mauck, then 55, got a call from a child-protective-services agent informing her that her granddaughter had been taken into care, and asking if she could come pick her up. Mauck told her boss that she needed to leave, and drove 23 miles across Denver (in traffic) to fetch Briana, then 18 months old. “She had a diaper and one sock,” says Mauck. “And that's it. They gave me a borrowed car seat from the office.”\r\nMauck wasn’t told what her son or his girlfriend had done to lose their child, but she knew her son already had a child who had been adopted by another family. She and her husband thought they’d look after Briana for a few months. “All of us grandparents think that,” says Mauck, who now runs a peer-support group for grandparents in a similar position. “It's like, ‘Oh, of course I'll take her in. I'll talk to [the parents] and tell them what they need to do. Two months at the most, they'll be back on their feet and they'll have the child back.” Briana is now 20, and lived with the Maucks for most of her life.\r\nBriana’s story is not that unusual. In 2018, according to the Government Accounting Office, 2.7 million children whose parents were unable to care for them lived with relatives, usually grandparents. But only 139,000 of these kids were officially in foster care, meaning they lived with licensed foster parents. The American Community Survey puts the number a bit lower, but still too high: in 2022, it estimated that just under a million children were being cared for solely by grandparents. In any case, the number of children in danger of being separated from their parental homes is robust; the U.S. Department of Health and Human Services (HHS) reported about 600,000 cases of what it calls “child maltreatment” in 2021, the most recent year for which figures are available.\r\n“We had nothing,” when Briana arrived, says Mauck. “I had an extra bedroom. But I had no baby stuff.” A local charity, Family Tree, supported them with one month’s mortgage payment. “They got us a bed, a desk, linens, and they paid the electricity bill,” says Mauck. Despite that, she was so busy with Briana’s doctors' visits, court visits, and court-ordered family visits to each parent and the other set of grandparents that she had to switch to a part-time job. Things got tight. She applied for Temporary Aid for Needy Families (TANF) payments, but because the Maucks’ combined income put them above the income threshold, only Briana was eligible, and the payments were small. Mauck says she got $127. Then the 2007 financial crisis came, the Maucks were overextended, and the family lost their home to foreclosure.\r\nWhen people take in and raise a child who has no relation to them, they are supported by fellow taxpaying Americans with what’s known as Foster Care Maintenance Payments. This makes fiscal sense, because raising a child is expensive and exhausting—more so if the child is traumatized—and people who are willing to open their homes should not be financially penalized. It ultimately saves public money, and studies suggest single-family homes are almost always better for the children’s welfare than group homes.\r\nBut up until recently, people who took in a child who was related to them, known in the weird language of the welfare system as “kinship caregivers,” were largely excluded from this benefit. This is because it is only given to licensed foster parents, those who have been vetted and trained by a local foster-care agency. In Colorado, such parents, depending on the age and needs of the child and other factors, receive about $1,200 a month, far more than child-only TANF, which is currently $141.\r\nBy the end of November, this will officially change. The Biden Administration has instituted a new set of rules that prompts states to “provide kinship caregivers with the same level of financial assistance that any other foster care provider receives,” by allowing child-welfare agencies to “adopt simpler licensing or approval standards” for homes where extended family is taking in a child. Effectively, HHS wants family members to be treated differently from other foster parents, who have to meet a set of quite stringent requirements to become licensed, but to be paid the same.\r\n“This kinship rule is trying to make it really clear about the ability for states and jurisdictions to create the standards for relatives to be foster parents,” says commissioner for the Administration on Children, Youth and Families, Rebecca Jones Gaston. “The hope and intention is that we're creating some equity around how we're supporting family members caring for children that are in foster care, and supporting them in the same way that we would for a foster family that isn't related to the child.”\r\nThe new rules do not specify exactly how the licensing standards should change, but suggest such adjustments as allowing children to sleep in the same bedroom as other kids in the home and extending age limits on who can take a child in. Black and poor children are disproportionately involved in the child-welfare system, and sometimes relatives were discounted as potential foster families because they had insufficient income. Agencies may now choose to override these income minimums and also overlook such former dealbreakers as poor access to transportation, a home’s size, or potential foster parents’ low levels of literacy or education. The federal standards demand a criminal background check, but past crimes that don’t have anything to do with children may not mean an immediate disqualification.\r\nThe encouragement to streamline for relatives these conditions and the time-consuming process of meeting them is part of a big and comparatively recent pendulum swing toward keeping children close to their biological families. “That's been a radical shift really only in the past few years,” says Rita Soronen, the president and CEO of the Dave Thomas Foundation for Adoption, who’s worked in child welfare for more than three decades and is supportive, as are most foster and adoption agencies, of the new approach. “I can remember the days when literally [child protective agencies] would say, ‘No, we're not going to look at family. This child came from a bad family.’” Now, caseworkers who remove a child look first for extended family, including what’s known as “fictive kin,” people who were not related but important in the child’s life, and try to place the child there.\r\nStudies have shown that children who are placed with relatives change homes (or “placements”) less often. “We've known for quite some time that children that are placed with kin actually have much more stable placements, move less often, and their outcomes tend to be better,” says Soronen. “And so it really is, in some ways, us catching up and finding a mechanism to be able to do it.”\r\nThis isn’t to say there aren’t issues or points of contention. If a parent wants to see their children, or even take them back, relatives may find it hard to say no, even if that parent has been deemed dangerous by the state. It’s asking a lot of grandparents, for instance, to keep their own children away from their grandchildren. Sometimes people are less motivated to get sober when it’s family members who are housing their children. And it just seems strange, to many, to pay someone to raise their own flesh and blood, especially when ’s the possibility of abusing the system, as when a relative takes in a child and gets paid, but the child is really still in the care of his or her parent.\r\nBut in many ways, experts say, the new rules, which ACF estimates would cost the federal government $3.085 billion over 10 years, are just reflecting the situation on the ground. Because children are usually removed from parents in emergency situations, relatives and close friends—the people most likely to take the child and with whom it would be less distressing for the child to move in—are not usually licensed. “They wouldn't get the kind of financial support that a foster family gets,” says Soronen, “and so families would say, ‘I can't afford to do everything I need to do for this child. I wasn't planning to have a sibling group of three in my family.’ So it was set up to fail.”\r\nWhen the Administration for Children and Families (ACF) asked for public comments on the new rule, the tales of difficulty navigating the system flooded in. A grandfather in Tennessee took in four siblings and struggled with the extra burden, some grandparents had to move back from overseas or cash in their retirement benefits, and several had to return to work to support the child they’d taken in. One family almost failed getting licensed to look after a 16-year-old granddaughter because they didn’t have, and couldn’t afford, a pool gate.\r\nThe issue of licensing has been a particular bugbear for tribal communities, says Stanley Nix, a juvenile rehabilitation counselor at the Washington State Department of Children, Youth, and Families, and a member of the Tsimshian and Haida tribes. Many families are struggling to begin with, and would have little chance of getting licensed, but they take the children in anyway. “Maybe they have their own substance-use problems, maybe they have their own employment history problems, maybe they're in a community that has very limited opportunities for upward growth,” says Nix.\r\nUnder the Indian Child Welfare Act, recently upheld by the Supreme Court, families are supposed to be the first ports of call for children who need to be fostered. But they haven’t been given the support those placements need, says Nix. Decades ago, one of his sisters took in the children of a younger sister, who was struggling with addiction, but the financial burden then meant the whole family had to move in with Nix’s mother, who had already raised eight children and barely had enough for herself.\r\nHe believes that, as long as there is training as well, the payments the new rules envision could break the cycle of impoverishment and dysfunction, especially since children age out of foster care at 18 or 21 and are often then left without parental or institutional support. “If we were to take the youth and rather than putting them into a system family, kept them with their own family, who will be there forever, not just until they turn 18,” he says, “and provide the support, guidance, and training around developing good healthy relationships, how does that not make sense?”\r\nNot everyone is a fan of the new regulations. Naomi Schaefer Riley, a senior fellow at the American Enterprise Institute and author of No Way to Treat a Child: How the Foster Care System, Family Courts, and Racial Activists Are Wrecking Young Lives, believes that “putting a thumb on the scale” so that biological families are favored may endanger children by keeping them with a family that was problematic in the first place. “Often the same kinds of dysfunction that affect the immediate family affect the extended family,” says Schaefer Riley, “and I just don't think there's any way of getting away from that.”\r\nMany families bristle at having to be trained to look after relatives, especially if they’ve already been a big part of the children’s lives. But some commenters told the ACF they felt all foster parents, whether related or not, should be held to the same standards and undergo the same training. Schaefer Riley agrees. “A lot of these kids have been really traumatized,” she says. “Assuming that a kinship-family placement is going to be able to handle the kinds of behavior or mental-health challenges that a child has is a real problem.”\r\nNix’s experience has made him cautious about “automatically making the assumption that somehow the extended family hasn't been striving to be involved and provide better support and encouragement.” His family loved and worried about his sister. “If we could have held her down and stopped her from doing those things,” he says, “we would have done that.” And much of the problem, he contends, is that tribes need more institutional support to handle a crisis that poverty helped create. “They're going to be fighting and fighting and fighting over trying to find funding and support and connection,” he says, “and overwhelmed with the youth that are sitting there.”\r\nSchaefer Riley, Nix, Soronen, and Mauck agree on some things, namely that the foster-care system is in need of an overhaul. They believe that some of the licensing guidelines are ridiculous and arbitrary, but that all foster parents could benefit from some form of training, especially given the emphasis on family reunification, which often means children are kept with their biological parents longer. This is great when the parents can emerge from their difficulties. But those children who do eventually have to be removed are more traumatized when they arrive at their relative’s house.\r\nThe Dave Thomas Foundation for Adoption has been having an encouraging amount of success with a model that funds local foster and adoption agencies to hire extra staff to find extended family members, or other people with whom the child already has relationship, who might be able to take in children. \"In digging through that case file you'll find former foster parents, teachers other folks that are involved in his child's life,\" says Soronen, \"so that it doesn't have to necessarily be a stranger that steps forward.\"\r\nWhile Mauck supports the new rule and thinks if more families can get support, that's a good thing, she is under no illusions that it's a cure-all. Even if the licensing process is simplified, says Mauck, a lot of the grandparents she helps may not want to get involved with the system, because it invites too much interference into their families. And she worries that many of them still won’t meet the requirements under the new regulations. “The rules are not set up for grandparents and kin raising children,” says Mauck. “They're set up for these really nice foster parents who say, ‘Oh, I'd like to take in a child.’ It's their choice. They talk it over. Our families are messy, or we wouldn't have these children.”"
    },
    {
        "source":{
            "id":null,
            "name":"The Indian Express"
        },
        "topics": "Relationships",
        "author":"Jayashree Narayanan",
        "title":"Couples therapy: When and why should you go for it?",
        "description":"With the guidance of a therapist, you can articulate mutual goals, realign expectations, and revitalise intimacy",
        "url":"https://indianexpress.com/article/lifestyle/life-style/couples-therapy-when-and-why-risks-benefits-tips-iragapatru-9036453/",
        "image":"https://images.indianexpress.com/2023/11/couples-therapy_1600_freepik.jpg",
        "date":"2023-11-23",
        "content":"In this day and age, where most of us have a pseudo-life on social media, where we try to best each other all the time, it becomes increasingly complex to be open and show your authentic self without the fear of judgment. Therapy is one of the safe spaces where a person can open up and speak their mind.\r\nSo, to maintain healthy relationships, couples therapy is touted to be an excellent choice. The same was recently spoken about in the Tamil film Iragapatru on Netflix featuring a marriage counsellor, her clients who opt for therapy, and the intricacies of it.\r\n“Even when things are not bad between a couple, going for a session now and then can help promote healthy dialogue that may have been missing or it can bring to light any habits that may create a rift between partners,” said Dr Chandni Tugnait, psychotherapist, and life coach, and founder and director - Gateway of Healing.\r\nBesides establishing healthy communication, couple therapy builds trust between partners when the people involved do not shy away from being completely open with each other. According to Dr Tugnait, by creating a safe space for vulnerable dialogue, couples therapy allows you to illuminate blind spots, dismantle dysfunctional patterns, and rediscover each other with more compassion and wisdom. “When two individuals commit to doing the difficult personal work - confronting their insecurities, destructive behaviours, and unmet needs - they emerge with a renewed understanding of themselves and each other,” said Dr Tugnait.\r\n<span class=\"strong\">How does it work?</span>\r\nThe focus tends to be on communication, patterns of interaction, value systems, goals, and vision for life, explained clinical psychologist Kamna Chhibber. “The emphasis is laid on building a mutual understanding, becoming attuned to each other’s emotional experiences, understanding expectations, and responding to needs. Varying techniques, strategies, and approaches are utilised for the same,” mentioned Dr Chhibber.\r\nWith the guidance of a therapist, you can articulate mutual goals, realign expectations, and revitalise intimacy. “Partners discover how to fight fair, communicate lovingly during conflict, and repair rifts before resentment sets in. They build a toolkit of strategies for expressing appreciation, managing stress, and overcoming challenges as a team,” shared Dr Tugnait.\r\nWhile uncomfortable at times, couples therapy catalyses growth - deepening mutual trust, respect, and purpose. Dr Tugnait explained that for relationships to remain vibrant, we must be courageous enough to illuminate the darker corners and dedicate ourselves to change. “In essence, couples therapy is not merely a remedy for discord but a proactive step towards nurturing a resilient and loving bond,” said Dr Tugnait."
    },
    {
        "source":{
            "id":null,
            "name":"Phys.Org"
        },
        "topics": "Relationships",
        "author":"Catherine Vanner",
        "title":"Gender-based violence: Teaching about its root causes is necessary to address it",
        "description":"In 2022, 184 women and girls were killed by violence in Canada. This number has steadily increased in each of the past three years; 148 women and girls were killed in 2019, 172 in 2020 and 177 in 2021.",
        "url":"https://phys.org/news/2023-11-gender-based-violence-root.html",
        "image":"https://scx2.b-cdn.net/gfx/news/hires/2023/candle-vigil.jpg",
        "date":"2023-11-27",
        "content":"In 2022, 184 women and girls were killed by violence in Canada. This number has steadily increased in each of the past three years; 148 women and girls were killed in 2019, 172 in 2020 and 177 in 2021.\r\nThere were 6,423 incidences of anti-2SLGBTQIA+ protests and online hate in Canada in the first three months of 2023 alone. Expressions of hate toward trans and non-binary people and 2SLGBTQIA+ people more broadly have been rising.\r\nTransphobia and femicide are both forms of gender-based violence, defined as any form of violence directed toward somebody because of their gender, gender identity, gender expression or perceived gender.\r\nMy team of researchers, The Gender-Based Violence Teaching Network, created resources, professional development and a teaching toolkit to support more teachers to effectively teach students about the root causes and consequences of different forms of gender-based violence.\r\n<span class=\"strong\">Devastating effects</span>\r\nGender-based violence has devastating effects for those who experience it. In addition to immediate physical, psychological and/or sexual harm, it leads to increased economic insecurity and has detrimental impacts on mental health.\r\nGender-based violence is prevalent in our society. A 2021 survey by the Canadian Women's Foundation showed that two-thirds of 1,515 Canadian respondents know a woman who has experienced physical, sexual or emotional abuse. Despite this high prevalence, it is often not examined in schools as a social issue.\r\nMy analysis of Ontario secondary school curricula showed that some form of gender-based violence is mentioned at all grade levels. It is most frequently mentioned in upper-level optional social sciences and humanities courses (such as Grade 11 Gender Studies or Grade 12 Challenge and Change in Society).\r\nThese elective courses are also more likely to help students examine how gender-based violence is influenced by systems of power, discrimination and social constructs, including through the intersections of gender and racialization, disability and socioeconomic status.\r\n<span class=\"strong\">Need to learn how violence is normalized</span>\r\nTeachers told me that, unfortunately, these elective courses are not always offered and, when they are, they are most often taken by students already familiar with these ideas.\r\nThis means most Ontario students never learn about the connection between acts of violence and broader structures that normalize gender-based violence by discriminating against girls, women and 2SLGBTQIA+ people.\r\nFor example, Indigenous women and girls are 12 times more likely to be murdered or missing than other women in Canada. This disproportionate violence results from centuries of colonization, which continues to manifest through multigenerational and intergenerational trauma, social and economic marginalization, and institutional practices and social behaviors that maintain the status quo and ignore the agency and expertise of Indigenous women, girls and 2SLGBTQIA+ people.\r\n<span class=\"strong\">Overlooking power discrepancies</span>\r\nThere are required courses that mention some forms of gender-based violence, most notably Grade 9 Health and Physical Education. However, my analysis of this curriculum found it frames gender-based violence as an issue of individual responsibility, overlooking the ways power discrepancies can influence the situation and impact a person's ability to provide consent or respond to violence.\r\nThere are also brief mentions of several gender-based violence issues in the Grade 10 Canadian History and Civics and Citizenship courses, including missing and murdered Indigenous women and girls. My examination of the curriculum and teachers' experience teaching it, however, demonstrates these curricula do not prompt critical analysis of the social causes that led to these acts of violence.\r\n<span class=\"strong\">What effective teaching looks like</span>\r\nMy research demonstrated that some teachers are teaching about gender-based violence issues. They explain that effective teaching about gender-based violence involves grappling with the power and privilege of both students and teachers, intentionally cultivating relationships with and between students and with community resources and considering the root causes of gender-based violence as connected to patriarchy, colonialism, heteronormativity and cisnormativity.\r\nStudents call for education that conveys the holistic consequences for victims as real people, not just statistics, and that empowers them to understand and prevent gender-based violence in their lives and communities.\r\n<span class=\"strong\">Teaching toolkit</span>\r\nMy team created resources and professional development to respond to teachers' concerns that they lacked sufficient training and materials about gender-based violence, and that this discourages teaching about it.\r\nOur Teaching About Gender-Based Violence Toolkit is available on our project website. The toolkit has lesson plans, guidance notes and other teaching materials to support teachers to address gender-based violence topics. It aligns to Grade 8-12 Ontario curriculum expectations.\r\nTopics addressed include sexual assault, consent and healthy relationships, human trafficking, transphobia and homophobia, gender policing, cisnormativity and heteronormativity, missing and murdered Indigenous women, girls and Two-Spirit people and intimate partner violence.\r\nMore directly addressing gender-based violence through education can help the upcoming generation of Canadians understand how gender-based violence manifests across our society.\r\n<span class=\"strong\">More education needed</span>\r\nThe ongoing disappearance and murder of Indigenous women, girls and Two-Spirit people, the proliferation of hate toward 2SLGBTQIA+ people, the unmanageable demand for women's shelters and the emergence of new forms of sexual violence facilitated by technology show the importance of more education about gender-based violence.\r\nBroader awareness of its root causes and devastating consequences is necessary to better address it.\r\nTeachers are uniquely placed to support the development of students' understanding of gender-based violence. All educators are encouraged to explore the resources that we have created to help students understand that, tragically, gender-based violence exists all around them.\r\nWe need to teach students what it looks like and why it happens before we can empower them to collectively act to circumvent it in their lives and communities."
    },
    {
        "source":{
            "id":null,
            "name":"Forbes"
        },
        "topics": "Relationships",
        "author":"Soulaima Gourani",
        "title":"Unlocking Success- Embrace Growth Through Therapy And Coaching",
        "description":"This article delves into the intricate relationship between startups and their visionary leaders, underscoring the pivotal role that self-awareness and emotional well-...",
        "url":"https://www.forbes.com/sites/soulaimagourani/2023/11/22/unlocking-successembrace-growth-through-therapy-and-coaching/",
        "image":"https://imageio.forbes.com/specials-images/imageserve/655eb7914fdada39026d3b98/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "date":"2023-11-23",
        "content":"In the ever-evolving realm of startups, where success is typically linked to innovative ideas, strategic acumen, and agile execution, a frequently underestimated element significantly shapes a startup's journey—the personal trauma score of its founders\r\n<span class=\"strong\">Startup DNA - Reflecting the Founder's Traits</span>\r\nDuring a compelling speech at Stanford University recently, Garry Tan, President and CEO of Y Combinator (YC), illuminated the concept that startups transcend being mere entities—they are living organisms molded by the unique DNA of their founders. This revelation prompts a closer examination of how the personality, values, and leadership style of founders can permeate every facet of a startup, profoundly shaping its culture and decision-making processes.\r\n<span class=\"strong\">Unexamined Trauma and Explosive Conflicts</span>\r\nWhile the startup journey is inherently fraught with challenges, conflicts are an inevitable part of the terrain.\r\nHowever, when these conflicts are fueled by unexamined trauma, the consequences can be nothing short of catastrophic. Unresolved personal issues can manifest in professional settings, leading to explosive conflicts that jeopardize the stability and success of (any) company.\r\n<span class=\"strong\">The Call for Therapy and Coaching</span>\r\nAcknowledging the potential pitfalls, the entrepreneurial community is increasingly recognizing the critical role of mental health in startup success.\r\nThere is a growing movement, supported by venture capitalists, urging founders to proactively seek therapy or trauma coaching early in their entrepreneurial journey.\r\nThis emphasis on self-awareness, conflict resolution skills, and emotional intelligence becomes a linchpin for founders navigating the complexities of building and leading and growing a team.\r\n<span class=\"strong\">The Call for Therapy, Coaching, and ACE Tests</span>\r\nTaking this commitment a step further, founders are now encouraged not only to seek therapy or coaching but also to consider undergoing Adverse Childhood Experiences (ACE) tests. These tests serve as a profound tool, quantifying the impact of childhood trauma and providing a trauma score that acts as a roadmap to emotional well-being.\r\nUnderstanding one's trauma score is akin to unlocking the secrets of the emotional landscape.\r\nIt reveals potential triggers, unresolved issues, and behavioral patterns that might unconsciously influence decision-making and interpersonal dynamics. This self-awareness proves especially critical in conflict resolution within the startup setting.\r\nWithout knowledge of your trauma score, you may find addressing conflicts and fostering healthy relationships within teams to be a huge challenge!\r\nAs startups evolve and scale, the stakes escalate, and the potential for conflicts magnifies.\r\nEngaging in therapy, coaching etc becomes a proactive strategy to fortify emotional resilience. Waiting until the high-wire moments of growth may be too late, as the demands and pressures of scaling can amplify existing challenges, rendering them more intricate to navigate."
    },
    {
        "source":{
            "id":null,
            "name":"Psychology Today"
        },
        "topics": "Relationships",
        "author":"Bruce Y. Lee M.D.",
        "title":"The 'Penny Dating' Method—A Manipulative Trend",
        "description":"\"Penny dating\" is a manipulative approach to relationships that is damaging to self-worth.",
        "url":"https://www.psychologytoday.com/intl/blog/a-funny-bone-to-pick/202311/the-penny-dating-method-a-manipulative-trend",
        "image":"https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_91_1_1528x800/public/teaser_image/blog_entry/2023-11/pexels-andre-taissin-6052793.jpg?itok=2HEcl7c9",
        "date":"2023-11-27",
        "content":"People have coined a term for a rather manipulative dating move that's been trending on TikTok. It's called \"penny dating\": Someone views you as a piggy bank when first trying to woo you and then maintains a relationship with you. Over time, the person strategically reduces how much they invest in you and in the relationship, down to the point that the person need offer only \"pennies\" to maintain your interest.\r\nNot exactly the best way to build a healthy relationship: View the other person as a piggy bank. Not surprisingly, this \"piggy\" move has drawn the ire of a lot of folks on TikTok. Here's how penny dating apparently works:\r\n<ol><li><b>The initial wooing stage:</b> A person invests a lot of money, time, effort, and resources to garner your interest. This can be considered the 100% full-effort investment level.</li><li><b>The \"she already shows interest\" stage:</b> Once you're hooked, the other person decreases the investment down to, say, a 90% level. This saves that person's resources and may erode your feeling of self-worth a bit. That's because, deep down, you may be wondering whether you are even worthy of more attention.</li><li><b>The \"bump up the investment\" stage:</b> In case your interest wanes due to the lowered 90% investment, the other person then momentarily pushes up the investment just a bit, to around 95%, so that you feel an increase. Note, though, that this 95% level is still less than the initial 100%. Nevertheless, the 5% increase in theory further fuels your interest, allowing the other person to benefit despite no longer investing at a 100% level.</li><li><b>The \"gradual back-and-forth reduction in investment\" stage:</b> Over time, the other person progressively reduces their investment in you in an up-and-down manner, as described in Stage 2. A short period of 95% investment may be followed by a period of 80% investment followed by a short period of a slightly higher 85% level, which is still less than the previous 90% level. After a short time at the 85% level, the other person further drops their investment down to an even lower 70% level, and so on.</li><li><b>The \"penny maintenance\" stage:</b> Over time the investment level gets lower and lower. The steady decline could eventually get to the point where the other person is investing only a few percentage points of money, time, effort, and other resources—the equivalent of pennies. With you accustomed to such a low level of investment, the other can simply toss in a slightly higher investment—a nickel here and there—to keep you hooked. In theory, that person is able to keep your feelings of self-worth low and minimize the investment needed to keep the relationship going.</li></ol>\r\nTalk about strategy. If you want your self-esteem to get battered and to be around someone who doesn't do a whole lot for you, then penny dating may be for you. There are steps you can take to suss out those who may be penny dating you:\r\n<ol><li><b>Beware of love bombers or those who shower you with gifts too early:</b> Early on, dating should be more about two people getting to know each other rather than one person trying to win over the other.</li><li><b>Notice when someone pulls back for no apparent reason:</b> Healthy relationships should be the opposite: The more you get to know each other and like each other, the more you want to invest in the other person. A pullback is not necessarily a sign that the other person is penny dating you, but it does suggest that something is happening with the relationship that may deserve further discussion.</li><li><b>Look for other signs of manipulative behavior:</b> Manipulative behaviors usually do not occur in isolation. If someone is being manipulative in one manner, chances are they can be manipulative in other ways.</li><li><b>Have an open conversation with the other person:</b> Don't be afraid of calling out the behavior. If you can't have a frank, honest conversation about your relationship, then it may not be much of a real relationship.</li></ol>\r\nIf you do find someone penny dating you, you may have someone who is more into strategy than forming a real honest, open connection. It's probably time for a change, because who wants to waste time dealing with such chump change?"
    }
]